// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "appbartitle": MessageLookupByLibrary.simpleMessage("جودو"),
        "programmers": MessageLookupByLibrary.simpleMessage(
            "تمت البرمجة بواسطة : حسام علي"),
        "scree5paragraph1": MessageLookupByLibrary.simpleMessage(
            "   الجهد الكبير الذي يقع على عضلات اللاعب عند تنفيذ المجهود البدني يتطلب استخدام كمية إضافية من الأوكسجين , وهذا يأتي بتنظيم عملية التنفس وزيادة سرعته , وكذلك سرعة الدورة الدموية , إن زيادة الجهد البدني وحركات الجسم تسير جنباً إلى جنب مع زيادة عملة التمثيل الغذائي للجسم , وتكيف أجهزة الجسم نفسها تبعاً للظروف الخارجية التي تتصل بحركات اللاعب ومجهوده ."),
        "scree5paragraph2": MessageLookupByLibrary.simpleMessage(
            "   ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة ."),
        "scree5paragraph3": MessageLookupByLibrary.simpleMessage(
            "   فانه يجب أن لا تزيد الحركات والمجهود عن معدل هذه الطاقة حتى لاتحد نتائج عكسية وأضرار صحية وبدنية . ويجب إعداد هذه الأجهزة الإعداد الكافي بحيث يناسب المجهود البدني المنتظر أداؤه . ويكون ذلك بالقيام ببعض التمرينات البدنية وتدريبات الجري المتدرجة في القوة قبل بدء المباريات . وبذلك نصل إلى زيادة سرعة التنفس وندخل بالتالي نجد أن كمية كبيرة من الأوكسجين في جسم اللاعب , لمساعدة العضلات وأجهزة الجسم في أداء وظيفتها , وها يمنع إصابات الملاعب الشائعة."),
        "scree5paragraph4": MessageLookupByLibrary.simpleMessage(
            "   أما إذا لم تعد أجهزة الجسم الإعداد الكافي لتقبل أقصى الجهد المنظر أداءه , فيمكن أن تحدث إصابات الملاعب أو ما ظهر التعب الأولى التي تسمى (كرشة النفس ) . وهذه الظاهرة يمكن أن تستمر مع اللاعب فلا يتمكن من أداء واجبه في الملعب إلى أن تنتظم الأجهزة الداخلية وتعد لتقبل المجهود المطلوب أداؤه , ثم يصبح اللاعب مستعداً لتنفيذ واجباته , أي بعد حصوله على النفس الثاني."),
        "scree5paragraph5": MessageLookupByLibrary.simpleMessage(
            "   ويؤدى الإحماء العام بالمشي والجري الخفيف وبعض حركات الوثب والتمرينات البدنية الخاصة بالمرونة والرشاقة , وذلك كإعداد شامل لأجهزة الجسم وعضلاته ومفاصله المختلفة . وهذا القسم من الإعداد لا يكفي لتأهيل اللاعب للاشتراك في المباريات أو القسم الرئيسي من التدريب وأداء حركات الجري السريع بالكرة أو بدونها وحركات التمويه , إما الإحماء الخاص فيعمل على أعداد اللاعب في جميع النواحي التي تم ذكرها , وتهيئته جميع الاحتمالات والحركات التي يؤديها في المباريات حتى يتجنب إصابات الملاعب."),
        "scree5paragraph6": MessageLookupByLibrary.simpleMessage(
            "   ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة ."),
        "screen1description":
            MessageLookupByLibrary.simpleMessage("تاريخ رياضة الجودو"),
        "screen1dialog1": MessageLookupByLibrary.simpleMessage(
            "التاريخ القديم يسجل لنا اول بداية لهذا النوع من النزال وهى المعركة الشهيرة التي تمت بين (نومينو سوكونة)والمحارب (تايما نوكوهاما) فى اليابان أيام الامبراطور (سونيين) عام 23 ق.م. "),
        "screen1dialog10": MessageLookupByLibrary.simpleMessage(
            "هي رياضة قتالية تجمع بين اللياقة البدنية والانضباط والتفكير السليم، وهي رياضة تقليدية يابانية. \n\nوتختلف بشكل كبير عن مثيلاتها من الرياضات القتالية الأخرى، فهي لا تعتمد على الركل والدفع، والضرب بالأيدي أو على أي من تقنيات القتال الأخرى، كذلك فهي تخلو من الأسلحة والأدوات التي تستعمل في الرياضات القتالية الأخرى. \n\nأن الترجمة الأدبية لكلمة  جودو  Judo باللغة الإنجليزية هي  الفن الرفيع  لكن هذه الترجمة تكون خادعة لأنها تناشد الصورة الهزلية للرياضة . \n\nوقد أشار ديس مارود Des Marwood إلى أن الجودو Judo عبارة عن كلمة تتكون من مقطعين هما : \n_ جو ( Ju ) وتعني الرفيع أو الرقيق وهي بالإنجليزية “ gentle “.\n_ دو (D0) وتعني الفن وهي بالإنجليزية .(art)\n\nلكن في الواقع أن الفن عبارة عن تحليل للمهارات من خلال دفاع الخصم في مساحة مغلقة ، وكلمة “Ju “ ترمز لمبدأ عدم الرد بعنف على العنف ويكون النقيد لكلمة “ Ju “ واصلها “Kendo” وترمز إلى القوة ضد القوة .\n\nويقال أن رياضة الجودو ليست يابانية ولكن لها جذورها التاريخية القديمة فقد كان هناك رجل أسمه (اكياما أوشيتو ) من مقاطعة نجازاكي في اليابان يدرس في الصين ، وهناك أعجب بمصارعة أهل الصين ، وكان ذلك في القرن السابع قبل الميلاد ، ثم قام بنقلها إلى موطنه ، لكن الصين نقلتها عن مصر القديمة ، حيث كان الفراعنة القدماء يمارسون هذا النوع من المصارعة منذ ثلاث آلاف عام قبل الميلاد ، ثم نقلت عن طريق الهكسوس إلى جنوب شرق أسيا بعد انتهاء غاراتهم وانهزامهم من الفراعنة القدماء في مصر ، حيث توجد العديد من الرسوم التي تشبه الكثير من حركات الجودو الآن وأيضاً ربط الحزام على البطن ، على جدران معابد بني حسن ، والعديد من المقابر الفرعونية القديمة .\n\nوالجودو أحدى الرياضات اليابانية النموذجية ذات الصفة أو الخاصية الدولية ، وهي تسهم بكونها مشكلة الثقافة بذاتها في احداث الصداقة والسلام بين دول وشعوب العالم بشكل هائل هذه الأيام ، وذلك بما تقدمه للشعوب من مجال يمكنهم أن يحققوا فيه التبادل المثمر فيما بينهم ، ومن ثم نجد ان لعبة الجودو تقدم المساعدة والعون لتعزيز السعادة والرخاء والرفاهية لجميع البشر ، وتلك هي رسالة الجودو ، وليس هناك من هدف أسمى من هذا الهدف .\n\nومنذ عقود عديدة خلت كانت رياضة الجودو تعتبر رياضة لا يتميز فيها إلا اليابانيون فقط ، غير أنه بتحقق الصفة الدولية لتلك الرياضة تحسن اداء لاعبي الجودو من شتى دول العالم تحسناً واضحاً ، وأظهروا مهارة وقوة عند مقارنتهم مع اللاعبين غير اليابانيين من التفوق على لاعبي الجودو اليابانيين حتى اصبحوا أبطالاً أوليمبيين او عالميين وتبين انجازاتهم بوضوح تام أن رياضة الجودو لم تعد حكرا على اليابان ولكنها قد أصبحت ملكاً للعالم بأكملة ، وهذا يساعد في أثارة مزيد من الانتشار، والتطور للجودو .\n\nويرجع ظهور رياضة الجودو بشكلها الحالي إلى  جيجور كانو  الذي ولد عام 1860 م ، وتعلم الأدب والفلسفة في جامعة طوكيو عام 1881م ، ويعتبر من الأعضاء المؤسسين للألعاب الأوليمبية عام 1896 م ، وقد تولى كانو وزارة التعليم في بلادة ، فجعل الجودو ضمن المواد التعليمية في المدارس في ذلك الوقت ، ثم توفي عام 1938م – أثناء رحلة عودته في البحر بسبب مرض فاجئة ، وذلك بعد اجتماع للإتحاد الدولي الأوليمبي في القاهرة ، وكان كانو  قبل وفاته قد قام بمجهودات عظيمة في شتى انحاء العالم من اجل نشر رياضة الجودو وزيادة الممارسين لها على مختلف المستويات .\n\nوقد قام  جيجور كانو  في عام 1882 بأنشاء اكاديمية عالمية لتعليم فنون الجودو المختلفة في طوكيو ، وأسمها  الكودوكان  ومعناها : الصالة التي يتم فيها التعليم والتدريب على القواعد .\n\n ويشير توني ، جيوفري إلى أنه في العصور القديمة في اليابان ومن عدة قرون مضت كانت السلطة والقوة تتركز في يد الحكومة الأقطاعية القوية على حساب الحكومة المركزية الضعيفة ، فكان لكل حاكم أقليم آنذاك مجموعة من المحاربين والمقاتلين الساموراي والذي يعتمد عليهم في حماية الأقليم من الاعتداءات والمشاكل الخارجية ، فكانت تلك الطبقة من الشعب تتدرب بقوة واجتهاد على القتال باستخدام الأيدي ، وأيضاً باستخدام السلاح وتقوم بالتدريب المنتظم على مهارات ركوب الخيل ، والسباحة .. الخ والتي تساعدهم أثناء المعارك والحروب .\n\nوكانت هناك مدارس متخصصة لتعليم تلك الفنون والحركات القتالية المختلفة لطبقة الساموراي حتى يكون هناك من يستطيع ردع الشعب اثناء اندلاع الثورات الشعبية وأثارة الشغب .\n\nوكان حتى منتصف القرن التاسع عشر لا يستطيع أي فرد من عامة الشعب التدريب على تلك الفنون القتالية فهي كانت حكرا فقط على المقاتلين الساموراي إلى أن جاءت حكومة جديدة عام 1873 م لتنهي هذا النظام واعفاء طبقة الساموراي من أعمالهم واحالتهم للتقاعد ، مما كان هذا هو السبب الرئيسي في انقسام الشعب إلى مجموعتين أثناء الاضطرابات والثورات منهم مجموعة تقوم بقمع أعمال الشغب وهي تمثل  البوليس والمجموعة الأخرى تحاول أن تقود إلى وظيفتها السابقة في طبقة الساموري ، وهي مجموعة البوليس  وعندما كان جيجور كانو  في الثامنة عشر من عمره أي في عام 1878 قام بجمع جميع الحركات التي كان يتدرب عليها طبقة الساموراي ، وهي تلك الحركات التي كانت تسمى بالـ الجوجيتسو ، وذلك في بلدة شينوريو وتحت اشراف رجلان هما هما فيوكيودا ، أيزو  وكان لهما مكانه عالية في الجامعة الحربية والتي انتهي تكوينها عام 1895 في مقاطعة  كيوتو  اليابانية ، فقام  كانوا بترتيب تلك الحركات واستبعاد الخطير والقاتل منها ثم قام بتحليلها والتوصل إلى النقاط الرئيسية في كيفية تعليم تلك الحركات لعامة الشعب في مدرسة خاصة وكانت تلك هي مدرسة الكودوكان ، والتي ذكرنا سالفا أنه قام بانشائها عام 1882م في طوكيو باليابان.\n\nويعتبر الكودوكان  هي المكان الذي يتوافد إلى الناس من كل أنحاء العالم للتعليم والتدريب ، ومعرفة كل جديد عن رياضة الجودو ، ذلك لوجود الخبرات رفيعة المستوى من معلمين ومدربين يستطيعون ترسيخ تلك الخبرات وصقلها لدى الوافدين إلى الكودوكان .\n\nوكانت رياضة الجودو قد دخلت مصر لأول مرة عام 1934 عن طريق الخبراء اليابانيين لتدريب قوات الجيش والبوليس في ذلك الوقت على المهارات القتالية الموجودة في هذه الرياضة في هذه الرياضة ، وفي عام 1952 م تم تكوين الاتحاد الدول للجودو (I J F) والذي يشترك فيه حتى الأن اكثر من مائة دولة ، وتم قبول رياضة الجودو كرياضة أوليمبية في عام 1964 في الدورة الأوليمبية بطوكيو."),
        "screen1dialog11": MessageLookupByLibrary.simpleMessage(
            "تمتليء الالعاب القتاليه بالعنف والاثارة ولكن تتميز كل لعبه في مدمار خاص بها تتالق فيه وتسطع انوارها من خلاله فالفوائد الجسديه تشمل كل الالعاب القتاليه ولكن قليلا منها التي تتميز في اكثر من مجال هنا تتميز الجودو كرياضه فوائدها كثيرة ومنها"),
        "screen1dialog12": MessageLookupByLibrary.simpleMessage(
            "إن لكل مهارة في الجودو معناها و مغزاها الخاص بها.و إن أشكال الحركات كثيرة لا تحصى لان كل جزء من الجسم يمكن استخدامه في كافة الاتجاهات أي إلى الأعلى و إلى الأسفل و إلى الجهتين اليسرى و اليمنى.\n وذلك ضمن عدد كبير من المهارات التي تدعو الحاجة إليها.لذلك إذا مارس الشخص رياضة الجودو فان كافة عضلاته و عظامه تشتد و تقوى كما تزداد بنفس الوقت قوة أجهزته الداخلية فرياضة الجودو يمكنها أن تنمي وبسهولة جسما متناسقا و تجعله قويا.\nبالإضافة إلى أن المتبارين في الجودو يناضلان باذلين أقصى جهد للتفوق في فن هذه الرياضة و ذلك يجعل الفرد دوما على استعداد لبذل أفضل إمكانياته بسرعة ضد الحيل التي قد يلجا إليها الخصم. \nو بهذا الشكل فان هذه الرياضة تنمي حرية الحركة في الجسم و اليقظة التامة تجاه كل طارئ."),
        "screen1dialog13": MessageLookupByLibrary.simpleMessage(
            "أولا:عندما يقوم أي فرد بالمواظبة على رياضة الجودو بشكل معقول ومنتظم تحدث لديه تغيرات نفسية دون علمه.حيث يزداد نبله و تهذيبه.\n\nو أول ما يجنيه من ثمرات ممارسة الجودو هو الجرأة الأدبية و نعني بذلك الروح العالية التي تدفعه إلى خوض غمار الصعوبات من تلقاء نفسه أي أن يصبح ذو نفسية ثابتة.\n\nثانيا:إن الجودو تحتاج إلى صراع جسدي ينهمك به كامل الجسد و العقل معا ضمن ذلك يتهذب كل ذي قوة و ذلك كي يكون قادرا على دوما على كبح جماح نفسه و مراقبتها و مراقبة خصمه ايضا.لذلك سوف تنمو لدى ممارس رياضة الجودو بشكل تدريجي قوة القلب و شدة البأس و صلابة التصميم رباطة الجأش(السيطرة على النفس) و سرعة الخاطر المتسم بصحة المحاكمة العقلية بالاضافة الى التحلي بالحذر و يقظة الفكر."),
        "screen1dialog14": MessageLookupByLibrary.simpleMessage(
            "غالبا ما تصادفنا في حياتنا اليومية عوائق مادية أو عقلية و أحيانا تتعرض إلى بعض المخاطر.لذلك تقدم لنا تمارين الجودو التربية الجسمية والعقلية و تعلمنا الحركات الفتية القيمة التي تمكننا من حماية أنفسنا عند اللزوم."),
        "screen1dialog15": MessageLookupByLibrary.simpleMessage(
            "إن التماسك بالأيدي بين شخصين و آخر هو من الأعمال الغريزية للبشر لذلك نرى إن أبدع فن للتماسك بين أنواع الرياضة التماسك الذي يجري بالجودو،فإذا مارس انسان رياضة الجودو بشكل نظامي فسيرى إن التماسك فيه ممتع جدا الأمر الذي يدعوه إلى الاستمرار في مماؤسة الجودو طيلة حياته."),
        "screen1dialog16": MessageLookupByLibrary.simpleMessage(
            "كانت ميكانيكية او تشريحية او فسيولوجية او النفسية و الانتصار على الخصم ببلوغ اقصى مقدرة بأقل مجهود لتحقيق الكفاءة القصوى للعقل و الجسم."),
        "screen1dialog17": MessageLookupByLibrary.simpleMessage(
            "ولذلك تعتبر من احسن الرياضات التنافسية لانها تعمل على تكوين الشخصية وتزيد الفرد ثقة بنفسة و الرغبة فى التفوق والفوز و تنمية الشجاعة و تحقيق الشعور بالذات."),
        "screen1dialog18": MessageLookupByLibrary.simpleMessage(
            "فلما للجودو من تقاليد واداب عريقة ترجع الى الفى سنة صيغت تلك الرياضة بعدد من القيم و العادات منها احترام الغير و احترام الكبير وعدم التحدث اثناء التمرين واداب التحية اثناء الدربنا يهديك و الخروج و الاعتذار فى حالة الخطأ وغير ذلك من اداب وتقاليد اللعبة و سلوكياتها الاجتماعية التى تؤثر على الافراد و تنعكس بالتالى على الجميع."),
        "screen1dialog19": MessageLookupByLibrary.simpleMessage(
            "الجودو رياضةالاعمارالمختلفة من البالغين و الشباب و ذوى الاشكال والاحجام المختلفة وبالتالى فهى تعتبر رياضة للجميع من مختلف ابناء الشعب ما يكون اثارها فى رفع مستوى اللياقةالبدنية و الصحية وبذلك تحقق الهدف الامثل وهو زيادة الانتاج ورفع معيشة الافراد."),
        "screen1dialog2": MessageLookupByLibrary.simpleMessage(
            "تقابلا الرجلان وتقاتلا كلا منهما وكان لكل منهما اسلوبة الخاص فى القتال والمكون من مهارات المصارعة فى شكلها البدائى وفنون الضرب باليد والقدم وانتهت المعركة بمقتل المحارب (تايما نوكوهاما) نتيجة ضربة ضربة قوية بالقدم وكسر ضلوعه وكان ذلك القتال فى اليابان ."),
        "screen1dialog20": MessageLookupByLibrary.simpleMessage(
            "_ (1860) ولد الأستاذ جيجورو كانو مؤسس الجودو.\n_ (1880) عين جيجورو كانو مدير لجامعة طوكيو.\n_ (1882)تأسس معهد الكودوكان العالمي.\n_ (1886)انتشرت رياضة الجودو فى المدارس والجامعات اليابانية.\n_ (1910)وضعت خطة لتدريب وتعليم إعداد كبيرة من المدربين.\n_ (1918)دخلت رياضة الجودو الى انجلترا.\n_ (1938)توفى الأستاذ جيجورو كانو.\n_ (1939)دخلت رياضة الجودو الى أمريكا.\n_ (1938)أقيمت أول بطولة الإمبراطورية اليابانية للجودو.\n_ (1949)تكون الاتحاد اليابانى للجودو للهواة.\n_ (1952)تاسس الاتحاد الدولى للجودو.\n_ (1956)أقيمت اول بطولة للعالم للجودو.\n_ (1963)تاسس الاتحاد المصري للجودو.\n_ (1964)دخلت رياضة الجودو بالاولمبياد بطوكيو اول مرة ."),
        "screen1dialog3": MessageLookupByLibrary.simpleMessage(
            "بعد ذلك اهتمت الإمبراطورية اليابانية الحاكمة بهذا القتال . وفى عام 1375م ابتكر الامبراطور الياباني (شومو) يوم لاحتفال الفرسان المحاربين وهو يعرف باسم (يوم ساندوستسو)وكان هذا الاحتفال يشمل (الرمي بالسهام – الرمي بالسهام من على الخيل – المصارعة اليابانية ) ."),
        "screen1dialog4": MessageLookupByLibrary.simpleMessage(
            "وبعد 300عام من التوقف عن ذلك اليوم استؤنف هذا الاحتفال مرة أخرى وبنفس الأسلوب والهدف من ذلك إظهار العائلات الملكية براعة فرسانهم ."),
        "screen1dialog5": MessageLookupByLibrary.simpleMessage(
            "وفى تلك الفترة قام احد الفرسان الساموراى بوضع اول حجر فى رياضة الجودو وهى طريقة (كومى اوتشى) وهو أسلوب القتال يد بيد وعرفت هذه الطريقة بعد ذلك باسم (الجوجيتسو)."),
        "screen1dialog6": MessageLookupByLibrary.simpleMessage(
            "والباحثين فى التاريخ الياباني قالوا إن من المحتمل إن اول مدرسة نشأت على طريقة (كومى اوتشى) فى القتال كانت فى أواخر القرن السادس عشر وبداية القرن السابع عشر وان أصل هذا الفن كان مبهم ولاكن التاريخ الرسمي لليابان والذي كتب الامبراطور فى عام 720م قد أشار لدورة (ليكار-كوريا- صراع القوة) التي مارست فيها هذه الرياضة ."),
        "screen1dialog7": MessageLookupByLibrary.simpleMessage(
            "فن الجوجيتسو هو فن القتال اثناء الحرب وكان بدون قواعد والهدف منة المحافظة على الحياة بقتل المنافس الأخر حيث أن الهزيمة تعنى الموت والانتصار يعنى الحياة وكان يستخدمه المحاربين القدماء اليابانيين (الساموراى) وطبقة النبلاء والحكام وهو مأخوذ من بلاد التبت ثم انتقل الى الصين ومنها الى اليابان ويرجع الفضل فى نقلها لليابان الى طالب يدعى (اكباما اوشيتو)من نجازاكى والذي كان يدرس العلوم في الصين وقد لاحظ عند هبوب الرياح على شجرة الصفصاف الكبيرة فتنكسر تحت قوة الرياح بينما فروع شجرة الكرز الرفيعة اللينة تنثني ثم تعود لوضعها الأول بعد انتهاء شدة الرياح . ومن هنا بنيت الفلسفة الروحية لذلك الفن على المثال القائل (لا تكن صلبا )اى ذو قوة عضلية ثابتة فتنكسر لان القوة العضلية ثابتة نسبيا فهناك الأقوى إذا ما قورنت بأخرى .(ولا تكن لينا) اى ضعيف البدن ليس لديك لياقة بدنية فتعسر . ولاكن كن قويا مع اكتساب عنصر المرونة والقوة والسرعة والتحمل والرشاقة ومرتبطة بالمهارات الأساسية لتعطيك القدرة الحركية العالية وفن الجوجيتسو له مخاطر وحركات تؤدى للموت أحيانا ."),
        "screen1dialog8": MessageLookupByLibrary.simpleMessage(
            "ولفن الجوجيتسو مدارس مختلفة ومن أقدمها وأشهرها"),
        "screen1dialog9": MessageLookupByLibrary.simpleMessage(
            " _ مدرسة (تاكنو اوتشى )ومؤسسها (تاكنو اوتشى هيسا مورى ) عام 1532م وعلم تلاميذه فن (الكوجيوسوكو) وهو فن السيطرة والحجز. \n_ مدرسة (كيتو) ومؤسسها هو(تيرادا كان امون). \n_ مدرسة (كى اوشين )ومؤسسها(انيو جامى ناجا كاتسو). \n_ مدرسة (يوشين وميورا) كمدرستين ذات شهرة كبيرة جدا فى اليابان ونال اثنين من مدرسيها شهرة كبيرة جدا وهم (توشوكا )و(اسوماتا يوشين) وكان الهدف من ممارستها هو المحافظة على الحياة من التعرض للمخاطر والاعداد البدني وتقوية الجسم .\'"),
        "screen1subtitle1": MessageLookupByLibrary.simpleMessage("الجوجيتسو"),
        "screen1subtitle10": MessageLookupByLibrary.simpleMessage(
            "ز- الجودو يحقق الكثير من الاهداف التربوية:-"),
        "screen1subtitle11":
            MessageLookupByLibrary.simpleMessage("ح- الجودو رياضة للجميع:-"),
        "screen1subtitle2": MessageLookupByLibrary.simpleMessage("الجودو"),
        "screen1subtitle3": MessageLookupByLibrary.simpleMessage(
            "الجودو رياضة الفوائد المتنوعه"),
        "screen1subtitle4":
            MessageLookupByLibrary.simpleMessage("أ-التنمية الجسدية:"),
        "screen1subtitle5":
            MessageLookupByLibrary.simpleMessage("ب-التنمية العقلية:"),
        "screen1subtitle6":
            MessageLookupByLibrary.simpleMessage("جـ - الدفاع عن النفس:"),
        "screen1subtitle7":
            MessageLookupByLibrary.simpleMessage("د - الجودو نشاط ترويحي:"),
        "screen1subtitle8": MessageLookupByLibrary.simpleMessage(
            "هـ - الاستخدام الامثل للقوى:-"),
        "screen1subtitle9": MessageLookupByLibrary.simpleMessage(
            "و- الجودو يعمل على تحقيق الجوانب النفسية:-"),
        "screen4descreption1": MessageLookupByLibrary.simpleMessage(
            "يجب علينا قبل البدء في التدريب او المنافسة ارتداء البدلة جيداً وسوف نعرض طريقة ارتداء البدلة ويجب ارتداء البنطلون اولاً ثم السترة ثم الحزام كما بالطريقة التالية:-"),
        "screen4subtitle1": MessageLookupByLibrary.simpleMessage(
            "طريقة إرتداء بنطلون الجودو \'زوبون\':-"),
        "screen4subtitle2": MessageLookupByLibrary.simpleMessage(
            "طريقة إرتداء الجاكت \'يواجي\':-"),
        "screen4subtitle3": MessageLookupByLibrary.simpleMessage(
            " طريقة ربط الحزام \'اوبي\':-"),
        "screen4subtitle4":
            MessageLookupByLibrary.simpleMessage(" طريقة تطبيق بدلة الجودو:-"),
        "screen4subtitle5":
            MessageLookupByLibrary.simpleMessage(" طريقة تطبيق بدلة الجودو:-"),
        "screen4title":
            MessageLookupByLibrary.simpleMessage("طريقة ارتداء بدلة الجودو:-"),
        "screen4topic1": MessageLookupByLibrary.simpleMessage(
            "• يتم سحب ربطي البنطلون من الخلف كما بالشكل."),
        "screen4topic10": MessageLookupByLibrary.simpleMessage(
            "ثم نقوم بلف البدلة عن طريق الدوران كما بالشكل التالي:-"),
        "screen4topic11": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-ثم نقوم بربط الحزام كما بالشكل التالي:-"),
        "screen4topic12": MessageLookupByLibrary.simpleMessage(
            " لا يسمح للاعب بإرتداء إي ملابس إسفل جات الجودو\'يواجي\' و البنات فقط يرتدون تي شرت ابيض إسفل اليواجي."),
        "screen4topic2": MessageLookupByLibrary.simpleMessage(
            "• يتم سحب ربطي البنطلون من الخلف كما بالشكل."),
        "screen4topic3": MessageLookupByLibrary.simpleMessage(
            "• يتم ربط الرباطين من الامام مع بعضيهما كما بالشكل:-"),
        "screen4topic4": MessageLookupByLibrary.simpleMessage(
            "• يتم وضع الطرف الايمن من الجاكت ثم يوضع علية الطرف الايسر من الجاكت بحيث تظهر علامة صنع البدلة من إسفل الجاكت كما بالشكل:-"),
        "screen4topic5": MessageLookupByLibrary.simpleMessage(
            "• يتم وضع منتصف الحزام عند البطن عند السرة تقريباً من الامام كما بالشكل :-"),
        "screen4topic6": MessageLookupByLibrary.simpleMessage(
            "• يلف الحزام حول الوسط من الخلف ثم إلي الامام كما بالشكل التالي :-"),
        "screen4topic7": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال للحزام علي الطرف اليمين وندخلة من اسفل اللفتين للحزام من الامام حيث يصبح الطرف الشمال أعلي والطرف اليمين اسفل كما بالشكل :-"),
        "screen4topic8": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-"),
        "screen4topic9": MessageLookupByLibrary.simpleMessage(
            "يتم تطبيق البدلة كما بالشكل التالي :-"),
        "screen5subtitle1": MessageLookupByLibrary.simpleMessage(
            "نماذج لتدريبات الإحماء تستخدم في رياضة الجودو:"),
        "screen5subtitle2":
            MessageLookupByLibrary.simpleMessage("تمرينات الساقين: "),
        "screen5subtitle3": MessageLookupByLibrary.simpleMessage(
            " نماذج لإحماء بتمرينات يقوم بها أكثر من لاعب:"),
        "screen5subtitle4":
            MessageLookupByLibrary.simpleMessage("تدريبات الإحماء العادي:"),
        "screen5title": MessageLookupByLibrary.simpleMessage(
            "لما الاحماء (التسخين )مهم للاعبين الجودو:-"),
        "screen5topic1": MessageLookupByLibrary.simpleMessage(
            "1 ـ تمرينات الرقبة : ثني الرقبة من اليمين إلى اليسار أو العكس أو إلى الخلف ودوران الرأس من اليمين إلى اليسار. \n 2 ـ  تمرينات الذراعين : مرجحة الذراعين أماماً أسفل وجانباً , وضع الكفين أمام الصدر ونضغط المرفقين جانباً, وحركات دائرة بالذراعين برفعهم جانباً. \n 3 ـ تمرينات الجذع : الوقوف والذراعان عالياً وضغط الجذع والذراعان خلفاً ويكرر التدريب في وضع الجلوس , والوقوف والذراع أماما وضغط الجذع إلى الجانبين وبالتبادل بضغط الجذع أماما والى اسمع بمحاولة لمس الأرض بالجبهة. \n "),
        "screen5topic2": MessageLookupByLibrary.simpleMessage(
            "  الوقوف والذراعان جانباً ومرجعة الساقين جانبا ً , الوقوف والذراعان أماما ومرجعة الساقين أماما عالياً بالتبادل لمحاولة لمس اليدين مع مراعاة التدرج في التدريب , والجلوس ومد الساقين للأمام ورفع الركبة عالياً للمس الصدر بمساعدة اليدين , والوقوف وثني الركبتين كاملاً ثم مدهما."),
        "screen5topic3": MessageLookupByLibrary.simpleMessage(
            "1.تمرينات الرقبة : يحاول كل لاعب جذب رقبة اللاعب الأخر بيد واحدة. \n 2.تمرينات للذراعين : يقف اللاعبان وجهاً لوجه وأيديهما متشابكة أمام الصدر , ويؤدى   التمرين بثني الذراعين ومدهما. \n 3.تمرينات للجذع : يقف لاعبان والذراعان عالياً وظهر كل منهما للأخر وبينهما مسافة مناسبة , ويؤدى التمرين بثنى الجذع أماما والى أسفل مع محاولة تشابك الأيدي لزيادة ضغط الجذع إلى الخلف , يقف اللاعبان وجهاً لوجه مع تشابك ذراع احدهما بذراع الأخر , ورفع الذراع الأخرى عالياً , ويؤدى التدريب بان يجذب كل منهما الأخر مع قذف الذراع العلياً إلى الخلف. \n 4.تمرينات للساقين : يقف لاعبان وجهاً لوجه ويمسك كل منهما بيده ساق الأخر ويؤدى التدريب بالحجل على رجل واحدة , كما يقف لاعبان ظهر كل منهما للأخر , مع رفع الذراعين أماما ويؤدى التدريب بثي إحدى الركبتين ثنياً كاملاً ومد الساق الأخرى . \n "),
        "screen5topic4": MessageLookupByLibrary.simpleMessage(
            "1-المشي على المشطين . \n 2-المشي على كعب القدم . \n 3-المشي على الجانب الخارجي للقدم ثم الداخلي. \n 4-المشي مع ثني الركبتين قليلا . \n 5-المشي بخطوات طويلة . \n 6-المشي مع محاولة لمس الصدر بالركبة  . \n 7-المشي بخطوات سريعة مع حركات دائرية للذراعين . \n 8-المشي مع ثني الجذع أماما والى أسفل ولمس الأرض باليدين  المشي على ساق واحدة مع مسك مفصل القدم الأخرى بإحدى اليدين ثم التبديل . \n 9-الجري مع ثني الركبتين . \n 10-الوثب أماما ثم خلفاً . \n 11-الحجل على إحدى الساقين لمسافة معينة ثم التبديل للحجل على الأخرى . \n 12-الجري في اتجاه معكوس . \n 13-الجري ثم الجلوس أو الرقود ثم الجري مرة أخرى عند إشارة المدرب . \n 14-الجري مع أداء بعض حركات الخداع والتمويه. \n 15-الجري السريع ثم الوقوف مباشرة مع أشارة المدرب . \n 16-الجري السريع مع تبديل الاتجاه عند سماع إشارة المدرب . \n 17-الجري السريع ثم الارتماء على البطن عند إشارة المدرب . \n 18-الجري ثم الوثب بقدم واحدة والوثب بالقدمين معاً \n 19-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب. \n 20-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب. \n "),
        "title": MessageLookupByLibrary.simpleMessage("اهلا وسهلا")
      };
}
