// DO NOT EDIT. This is code generated via package:intl/generate_localized.dart
// This is a library that provides messages for a ar locale. All the
// messages from the main program should be duplicated here with the same
// function name.

// Ignore issues from commonly used lints in this file.
// ignore_for_file:unnecessary_brace_in_string_interps, unnecessary_new
// ignore_for_file:prefer_single_quotes,comment_references, directives_ordering
// ignore_for_file:annotate_overrides,prefer_generic_function_type_aliases
// ignore_for_file:unused_import, file_names, avoid_escaping_inner_quotes
// ignore_for_file:unnecessary_string_interpolations, unnecessary_string_escapes

import 'package:intl/intl.dart';
import 'package:intl/message_lookup_by_library.dart';

final messages = new MessageLookup();

typedef String MessageIfAbsent(String messageStr, List<dynamic> args);

class MessageLookup extends MessageLookupByLibrary {
  String get localeName => 'ar';

  final messages = _notInlinedMessages(_notInlinedMessages);
  static Map<String, Function> _notInlinedMessages(_) => <String, Function>{
        "appbartitle": MessageLookupByLibrary.simpleMessage("جودو"),
        "doctors": MessageLookupByLibrary.simpleMessage("د/انور خطاب "),
        "hometitle1":
            MessageLookupByLibrary.simpleMessage("تاريخ رياضة الجودو "),
        "hometitle2": MessageLookupByLibrary.simpleMessage(
            "الاوضاع الاساسية في رياضية الجودو"),
        "hometitle3":
            MessageLookupByLibrary.simpleMessage("اداب وتقاليد رياضة الجودو"),
        "hometitle4": MessageLookupByLibrary.simpleMessage(
            "طريقة ارتداء البدلة للمبتدئين"),
        "hometitle5":
            MessageLookupByLibrary.simpleMessage("اهمية الاحماء للاعبي الجودو"),
        "hometitle6": MessageLookupByLibrary.simpleMessage(
            "اهم مهارات اللعب من اعلي للاعبي الجودو"),
        "hometitle7":
            MessageLookupByLibrary.simpleMessage("مصطلحات رياضية الجودو"),
        "programmers": MessageLookupByLibrary.simpleMessage(
            " تمت البرمجة بواسطة : حسام علي و يوسف مدحت و خالد احمد و ابانوب عماد"),
        "scree5paragraph1": MessageLookupByLibrary.simpleMessage(
            "   الجهد الكبير الذي يقع على عضلات اللاعب عند تنفيذ المجهود البدني يتطلب استخدام كمية إضافية من الأوكسجين , وهذا يأتي بتنظيم عملية التنفس وزيادة سرعته , وكذلك سرعة الدورة الدموية , إن زيادة الجهد البدني وحركات الجسم تسير جنباً إلى جنب مع زيادة عملة التمثيل الغذائي للجسم , وتكيف أجهزة الجسم نفسها تبعاً للظروف الخارجية التي تتصل بحركات اللاعب ومجهوده ."),
        "scree5paragraph2": MessageLookupByLibrary.simpleMessage(
            "   ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة ."),
        "scree5paragraph3": MessageLookupByLibrary.simpleMessage(
            "   فانه يجب أن لا تزيد الحركات والمجهود عن معدل هذه الطاقة حتى لاتحد نتائج عكسية وأضرار صحية وبدنية . ويجب إعداد هذه الأجهزة الإعداد الكافي بحيث يناسب المجهود البدني المنتظر أداؤه . ويكون ذلك بالقيام ببعض التمرينات البدنية وتدريبات الجري المتدرجة في القوة قبل بدء المباريات . وبذلك نصل إلى زيادة سرعة التنفس وندخل بالتالي نجد أن كمية كبيرة من الأوكسجين في جسم اللاعب , لمساعدة العضلات وأجهزة الجسم في أداء وظيفتها , وها يمنع إصابات الملاعب الشائعة."),
        "scree5paragraph4": MessageLookupByLibrary.simpleMessage(
            "   أما إذا لم تعد أجهزة الجسم الإعداد الكافي لتقبل أقصى الجهد المنظر أداءه , فيمكن أن تحدث إصابات الملاعب أو ما ظهر التعب الأولى التي تسمى (كرشة النفس ) . وهذه الظاهرة يمكن أن تستمر مع اللاعب فلا يتمكن من أداء واجبه في الملعب إلى أن تنتظم الأجهزة الداخلية وتعد لتقبل المجهود المطلوب أداؤه , ثم يصبح اللاعب مستعداً لتنفيذ واجباته , أي بعد حصوله على النفس الثاني."),
        "scree5paragraph5": MessageLookupByLibrary.simpleMessage(
            "   ويؤدى الإحماء العام بالمشي والجري الخفيف وبعض حركات الوثب والتمرينات البدنية الخاصة بالمرونة والرشاقة , وذلك كإعداد شامل لأجهزة الجسم وعضلاته ومفاصله المختلفة . وهذا القسم من الإعداد لا يكفي لتأهيل اللاعب للاشتراك في المباريات أو القسم الرئيسي من التدريب وأداء حركات الجري السريع بالكرة أو بدونها وحركات التمويه , إما الإحماء الخاص فيعمل على أعداد اللاعب في جميع النواحي التي تم ذكرها , وتهيئته جميع الاحتمالات والحركات التي يؤديها في المباريات حتى يتجنب إصابات الملاعب."),
        "scree5paragraph6": MessageLookupByLibrary.simpleMessage(
            "   ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة ."),
        "screen1description":
            MessageLookupByLibrary.simpleMessage("تاريخ رياضة الجودو"),
        "screen1dialog1": MessageLookupByLibrary.simpleMessage(
            "التاريخ القديم يسجل لنا اول بداية لهذا النوع من النزال وهى المعركة الشهيرة التي تمت بين (نومينو سوكونة)والمحارب (تايما نوكوهاما) فى اليابان أيام الامبراطور (سونيين) عام 23 ق.م. "),
        "screen1dialog10": MessageLookupByLibrary.simpleMessage(
            "هي رياضة قتالية تجمع بين اللياقة البدنية والانضباط والتفكير السليم، وهي رياضة تقليدية يابانية. \n\nوتختلف بشكل كبير عن مثيلاتها من الرياضات القتالية الأخرى، فهي لا تعتمد على الركل والدفع، والضرب بالأيدي أو على أي من تقنيات القتال الأخرى، كذلك فهي تخلو من الأسلحة والأدوات التي تستعمل في الرياضات القتالية الأخرى. \n\nأن الترجمة الأدبية لكلمة  جودو  Judo باللغة الإنجليزية هي  الفن الرفيع  لكن هذه الترجمة تكون خادعة لأنها تناشد الصورة الهزلية للرياضة . \n\nوقد أشار ديس مارود Des Marwood إلى أن الجودو Judo عبارة عن كلمة تتكون من مقطعين هما : \n_ جو ( Ju ) وتعني الرفيع أو الرقيق وهي بالإنجليزية “ gentle “.\n_ دو (D0) وتعني الفن وهي بالإنجليزية .(art)\n\nلكن في الواقع أن الفن عبارة عن تحليل للمهارات من خلال دفاع الخصم في مساحة مغلقة ، وكلمة “Ju “ ترمز لمبدأ عدم الرد بعنف على العنف ويكون النقيد لكلمة “ Ju “ واصلها “Kendo” وترمز إلى القوة ضد القوة .\n\nويقال أن رياضة الجودو ليست يابانية ولكن لها جذورها التاريخية القديمة فقد كان هناك رجل أسمه (اكياما أوشيتو ) من مقاطعة نجازاكي في اليابان يدرس في الصين ، وهناك أعجب بمصارعة أهل الصين ، وكان ذلك في القرن السابع قبل الميلاد ، ثم قام بنقلها إلى موطنه ، لكن الصين نقلتها عن مصر القديمة ، حيث كان الفراعنة القدماء يمارسون هذا النوع من المصارعة منذ ثلاث آلاف عام قبل الميلاد ، ثم نقلت عن طريق الهكسوس إلى جنوب شرق أسيا بعد انتهاء غاراتهم وانهزامهم من الفراعنة القدماء في مصر ، حيث توجد العديد من الرسوم التي تشبه الكثير من حركات الجودو الآن وأيضاً ربط الحزام على البطن ، على جدران معابد بني حسن ، والعديد من المقابر الفرعونية القديمة .\n\nوالجودو أحدى الرياضات اليابانية النموذجية ذات الصفة أو الخاصية الدولية ، وهي تسهم بكونها مشكلة الثقافة بذاتها في احداث الصداقة والسلام بين دول وشعوب العالم بشكل هائل هذه الأيام ، وذلك بما تقدمه للشعوب من مجال يمكنهم أن يحققوا فيه التبادل المثمر فيما بينهم ، ومن ثم نجد ان لعبة الجودو تقدم المساعدة والعون لتعزيز السعادة والرخاء والرفاهية لجميع البشر ، وتلك هي رسالة الجودو ، وليس هناك من هدف أسمى من هذا الهدف .\n\nومنذ عقود عديدة خلت كانت رياضة الجودو تعتبر رياضة لا يتميز فيها إلا اليابانيون فقط ، غير أنه بتحقق الصفة الدولية لتلك الرياضة تحسن اداء لاعبي الجودو من شتى دول العالم تحسناً واضحاً ، وأظهروا مهارة وقوة عند مقارنتهم مع اللاعبين غير اليابانيين من التفوق على لاعبي الجودو اليابانيين حتى اصبحوا أبطالاً أوليمبيين او عالميين وتبين انجازاتهم بوضوح تام أن رياضة الجودو لم تعد حكرا على اليابان ولكنها قد أصبحت ملكاً للعالم بأكملة ، وهذا يساعد في أثارة مزيد من الانتشار، والتطور للجودو .\n\nويرجع ظهور رياضة الجودو بشكلها الحالي إلى  جيجور كانو  الذي ولد عام 1860 م ، وتعلم الأدب والفلسفة في جامعة طوكيو عام 1881م ، ويعتبر من الأعضاء المؤسسين للألعاب الأوليمبية عام 1896 م ، وقد تولى كانو وزارة التعليم في بلادة ، فجعل الجودو ضمن المواد التعليمية في المدارس في ذلك الوقت ، ثم توفي عام 1938م – أثناء رحلة عودته في البحر بسبب مرض فاجئة ، وذلك بعد اجتماع للإتحاد الدولي الأوليمبي في القاهرة ، وكان كانو  قبل وفاته قد قام بمجهودات عظيمة في شتى انحاء العالم من اجل نشر رياضة الجودو وزيادة الممارسين لها على مختلف المستويات .\n\nوقد قام  جيجور كانو  في عام 1882 بأنشاء اكاديمية عالمية لتعليم فنون الجودو المختلفة في طوكيو ، وأسمها  الكودوكان  ومعناها : الصالة التي يتم فيها التعليم والتدريب على القواعد .\n\n ويشير توني ، جيوفري إلى أنه في العصور القديمة في اليابان ومن عدة قرون مضت كانت السلطة والقوة تتركز في يد الحكومة الأقطاعية القوية على حساب الحكومة المركزية الضعيفة ، فكان لكل حاكم أقليم آنذاك مجموعة من المحاربين والمقاتلين الساموراي والذي يعتمد عليهم في حماية الأقليم من الاعتداءات والمشاكل الخارجية ، فكانت تلك الطبقة من الشعب تتدرب بقوة واجتهاد على القتال باستخدام الأيدي ، وأيضاً باستخدام السلاح وتقوم بالتدريب المنتظم على مهارات ركوب الخيل ، والسباحة .. الخ والتي تساعدهم أثناء المعارك والحروب .\n\nوكانت هناك مدارس متخصصة لتعليم تلك الفنون والحركات القتالية المختلفة لطبقة الساموراي حتى يكون هناك من يستطيع ردع الشعب اثناء اندلاع الثورات الشعبية وأثارة الشغب .\n\nوكان حتى منتصف القرن التاسع عشر لا يستطيع أي فرد من عامة الشعب التدريب على تلك الفنون القتالية فهي كانت حكرا فقط على المقاتلين الساموراي إلى أن جاءت حكومة جديدة عام 1873 م لتنهي هذا النظام واعفاء طبقة الساموراي من أعمالهم واحالتهم للتقاعد ، مما كان هذا هو السبب الرئيسي في انقسام الشعب إلى مجموعتين أثناء الاضطرابات والثورات منهم مجموعة تقوم بقمع أعمال الشغب وهي تمثل  البوليس والمجموعة الأخرى تحاول أن تقود إلى وظيفتها السابقة في طبقة الساموري ، وهي مجموعة البوليس  وعندما كان جيجور كانو  في الثامنة عشر من عمره أي في عام 1878 قام بجمع جميع الحركات التي كان يتدرب عليها طبقة الساموراي ، وهي تلك الحركات التي كانت تسمى بالـ الجوجيتسو ، وذلك في بلدة شينوريو وتحت اشراف رجلان هما هما فيوكيودا ، أيزو  وكان لهما مكانه عالية في الجامعة الحربية والتي انتهي تكوينها عام 1895 في مقاطعة  كيوتو  اليابانية ، فقام  كانوا بترتيب تلك الحركات واستبعاد الخطير والقاتل منها ثم قام بتحليلها والتوصل إلى النقاط الرئيسية في كيفية تعليم تلك الحركات لعامة الشعب في مدرسة خاصة وكانت تلك هي مدرسة الكودوكان ، والتي ذكرنا سالفا أنه قام بانشائها عام 1882م في طوكيو باليابان.\n\nويعتبر الكودوكان  هي المكان الذي يتوافد إلى الناس من كل أنحاء العالم للتعليم والتدريب ، ومعرفة كل جديد عن رياضة الجودو ، ذلك لوجود الخبرات رفيعة المستوى من معلمين ومدربين يستطيعون ترسيخ تلك الخبرات وصقلها لدى الوافدين إلى الكودوكان .\n\nوكانت رياضة الجودو قد دخلت مصر لأول مرة عام 1934 عن طريق الخبراء اليابانيين لتدريب قوات الجيش والبوليس في ذلك الوقت على المهارات القتالية الموجودة في هذه الرياضة في هذه الرياضة ، وفي عام 1952 م تم تكوين الاتحاد الدول للجودو (I J F) والذي يشترك فيه حتى الأن اكثر من مائة دولة ، وتم قبول رياضة الجودو كرياضة أوليمبية في عام 1964 في الدورة الأوليمبية بطوكيو."),
        "screen1dialog11": MessageLookupByLibrary.simpleMessage(
            "تمتليء الالعاب القتاليه بالعنف والاثارة ولكن تتميز كل لعبه في مدمار خاص بها تتالق فيه وتسطع انوارها من خلاله فالفوائد الجسديه تشمل كل الالعاب القتاليه ولكن قليلا منها التي تتميز في اكثر من مجال هنا تتميز الجودو كرياضه فوائدها كثيرة ومنها"),
        "screen1dialog12": MessageLookupByLibrary.simpleMessage(
            "إن لكل مهارة في الجودو معناها و مغزاها الخاص بها.و إن أشكال الحركات كثيرة لا تحصى لان كل جزء من الجسم يمكن استخدامه في كافة الاتجاهات أي إلى الأعلى و إلى الأسفل و إلى الجهتين اليسرى و اليمنى.\n وذلك ضمن عدد كبير من المهارات التي تدعو الحاجة إليها.لذلك إذا مارس الشخص رياضة الجودو فان كافة عضلاته و عظامه تشتد و تقوى كما تزداد بنفس الوقت قوة أجهزته الداخلية فرياضة الجودو يمكنها أن تنمي وبسهولة جسما متناسقا و تجعله قويا.\nبالإضافة إلى أن المتبارين في الجودو يناضلان باذلين أقصى جهد للتفوق في فن هذه الرياضة و ذلك يجعل الفرد دوما على استعداد لبذل أفضل إمكانياته بسرعة ضد الحيل التي قد يلجا إليها الخصم. \nو بهذا الشكل فان هذه الرياضة تنمي حرية الحركة في الجسم و اليقظة التامة تجاه كل طارئ."),
        "screen1dialog13": MessageLookupByLibrary.simpleMessage(
            "أولا:عندما يقوم أي فرد بالمواظبة على رياضة الجودو بشكل معقول ومنتظم تحدث لديه تغيرات نفسية دون علمه.حيث يزداد نبله و تهذيبه.\n\nو أول ما يجنيه من ثمرات ممارسة الجودو هو الجرأة الأدبية و نعني بذلك الروح العالية التي تدفعه إلى خوض غمار الصعوبات من تلقاء نفسه أي أن يصبح ذو نفسية ثابتة.\n\nثانيا:إن الجودو تحتاج إلى صراع جسدي ينهمك به كامل الجسد و العقل معا ضمن ذلك يتهذب كل ذي قوة و ذلك كي يكون قادرا على دوما على كبح جماح نفسه و مراقبتها و مراقبة خصمه ايضا.لذلك سوف تنمو لدى ممارس رياضة الجودو بشكل تدريجي قوة القلب و شدة البأس و صلابة التصميم رباطة الجأش(السيطرة على النفس) و سرعة الخاطر المتسم بصحة المحاكمة العقلية بالاضافة الى التحلي بالحذر و يقظة الفكر."),
        "screen1dialog14": MessageLookupByLibrary.simpleMessage(
            "غالبا ما تصادفنا في حياتنا اليومية عوائق مادية أو عقلية و أحيانا تتعرض إلى بعض المخاطر.لذلك تقدم لنا تمارين الجودو التربية الجسمية والعقلية و تعلمنا الحركات الفتية القيمة التي تمكننا من حماية أنفسنا عند اللزوم."),
        "screen1dialog15": MessageLookupByLibrary.simpleMessage(
            "إن التماسك بالأيدي بين شخصين و آخر هو من الأعمال الغريزية للبشر لذلك نرى إن أبدع فن للتماسك بين أنواع الرياضة التماسك الذي يجري بالجودو،فإذا مارس انسان رياضة الجودو بشكل نظامي فسيرى إن التماسك فيه ممتع جدا الأمر الذي يدعوه إلى الاستمرار في مماؤسة الجودو طيلة حياته."),
        "screen1dialog16": MessageLookupByLibrary.simpleMessage(
            "كانت ميكانيكية او تشريحية او فسيولوجية او النفسية و الانتصار على الخصم ببلوغ اقصى مقدرة بأقل مجهود لتحقيق الكفاءة القصوى للعقل و الجسم."),
        "screen1dialog17": MessageLookupByLibrary.simpleMessage(
            "ولذلك تعتبر من احسن الرياضات التنافسية لانها تعمل على تكوين الشخصية وتزيد الفرد ثقة بنفسة و الرغبة فى التفوق والفوز و تنمية الشجاعة و تحقيق الشعور بالذات."),
        "screen1dialog18": MessageLookupByLibrary.simpleMessage(
            "فلما للجودو من تقاليد واداب عريقة ترجع الى الفى سنة صيغت تلك الرياضة بعدد من القيم و العادات منها احترام الغير و احترام الكبير وعدم التحدث اثناء التمرين واداب التحية اثناء الدربنا يهديك و الخروج و الاعتذار فى حالة الخطأ وغير ذلك من اداب وتقاليد اللعبة و سلوكياتها الاجتماعية التى تؤثر على الافراد و تنعكس بالتالى على الجميع."),
        "screen1dialog19": MessageLookupByLibrary.simpleMessage(
            "الجودو رياضةالاعمارالمختلفة من البالغين و الشباب و ذوى الاشكال والاحجام المختلفة وبالتالى فهى تعتبر رياضة للجميع من مختلف ابناء الشعب ما يكون اثارها فى رفع مستوى اللياقةالبدنية و الصحية وبذلك تحقق الهدف الامثل وهو زيادة الانتاج ورفع معيشة الافراد."),
        "screen1dialog2": MessageLookupByLibrary.simpleMessage(
            "تقابلا الرجلان وتقاتلا كلا منهما وكان لكل منهما اسلوبة الخاص فى القتال والمكون من مهارات المصارعة فى شكلها البدائى وفنون الضرب باليد والقدم وانتهت المعركة بمقتل المحارب (تايما نوكوهاما) نتيجة ضربة ضربة قوية بالقدم وكسر ضلوعه وكان ذلك القتال فى اليابان ."),
        "screen1dialog20": MessageLookupByLibrary.simpleMessage(
            "_ (1860) ولد الأستاذ جيجورو كانو مؤسس الجودو.\n_ (1880) عين جيجورو كانو مدير لجامعة طوكيو.\n_ (1882)تأسس معهد الكودوكان العالمي.\n_ (1886)انتشرت رياضة الجودو فى المدارس والجامعات اليابانية.\n_ (1910)وضعت خطة لتدريب وتعليم إعداد كبيرة من المدربين.\n_ (1918)دخلت رياضة الجودو الى انجلترا.\n_ (1938)توفى الأستاذ جيجورو كانو.\n_ (1939)دخلت رياضة الجودو الى أمريكا.\n_ (1938)أقيمت أول بطولة الإمبراطورية اليابانية للجودو.\n_ (1949)تكون الاتحاد اليابانى للجودو للهواة.\n_ (1952)تاسس الاتحاد الدولى للجودو.\n_ (1956)أقيمت اول بطولة للعالم للجودو.\n_ (1963)تاسس الاتحاد المصري للجودو.\n_ (1964)دخلت رياضة الجودو بالاولمبياد بطوكيو اول مرة ."),
        "screen1dialog3": MessageLookupByLibrary.simpleMessage(
            "بعد ذلك اهتمت الإمبراطورية اليابانية الحاكمة بهذا القتال . وفى عام 1375م ابتكر الامبراطور الياباني (شومو) يوم لاحتفال الفرسان المحاربين وهو يعرف باسم (يوم ساندوستسو)وكان هذا الاحتفال يشمل (الرمي بالسهام – الرمي بالسهام من على الخيل – المصارعة اليابانية ) ."),
        "screen1dialog4": MessageLookupByLibrary.simpleMessage(
            "وبعد 300عام من التوقف عن ذلك اليوم استؤنف هذا الاحتفال مرة أخرى وبنفس الأسلوب والهدف من ذلك إظهار العائلات الملكية براعة فرسانهم ."),
        "screen1dialog5": MessageLookupByLibrary.simpleMessage(
            "وفى تلك الفترة قام احد الفرسان الساموراى بوضع اول حجر فى رياضة الجودو وهى طريقة (كومى اوتشى) وهو أسلوب القتال يد بيد وعرفت هذه الطريقة بعد ذلك باسم (الجوجيتسو)."),
        "screen1dialog6": MessageLookupByLibrary.simpleMessage(
            "والباحثين فى التاريخ الياباني قالوا إن من المحتمل إن اول مدرسة نشأت على طريقة (كومى اوتشى) فى القتال كانت فى أواخر القرن السادس عشر وبداية القرن السابع عشر وان أصل هذا الفن كان مبهم ولاكن التاريخ الرسمي لليابان والذي كتب الامبراطور فى عام 720م قد أشار لدورة (ليكار-كوريا- صراع القوة) التي مارست فيها هذه الرياضة ."),
        "screen1dialog7": MessageLookupByLibrary.simpleMessage(
            "فن الجوجيتسو هو فن القتال اثناء الحرب وكان بدون قواعد والهدف منة المحافظة على الحياة بقتل المنافس الأخر حيث أن الهزيمة تعنى الموت والانتصار يعنى الحياة وكان يستخدمه المحاربين القدماء اليابانيين (الساموراى) وطبقة النبلاء والحكام وهو مأخوذ من بلاد التبت ثم انتقل الى الصين ومنها الى اليابان ويرجع الفضل فى نقلها لليابان الى طالب يدعى (اكباما اوشيتو)من نجازاكى والذي كان يدرس العلوم في الصين وقد لاحظ عند هبوب الرياح على شجرة الصفصاف الكبيرة فتنكسر تحت قوة الرياح بينما فروع شجرة الكرز الرفيعة اللينة تنثني ثم تعود لوضعها الأول بعد انتهاء شدة الرياح . ومن هنا بنيت الفلسفة الروحية لذلك الفن على المثال القائل (لا تكن صلبا )اى ذو قوة عضلية ثابتة فتنكسر لان القوة العضلية ثابتة نسبيا فهناك الأقوى إذا ما قورنت بأخرى .(ولا تكن لينا) اى ضعيف البدن ليس لديك لياقة بدنية فتعسر . ولاكن كن قويا مع اكتساب عنصر المرونة والقوة والسرعة والتحمل والرشاقة ومرتبطة بالمهارات الأساسية لتعطيك القدرة الحركية العالية وفن الجوجيتسو له مخاطر وحركات تؤدى للموت أحيانا ."),
        "screen1dialog8": MessageLookupByLibrary.simpleMessage(
            "ولفن الجوجيتسو مدارس مختلفة ومن أقدمها وأشهرها"),
        "screen1dialog9": MessageLookupByLibrary.simpleMessage(
            " _ مدرسة (تاكنو اوتشى )ومؤسسها (تاكنو اوتشى هيسا مورى ) عام 1532م وعلم تلاميذه فن (الكوجيوسوكو) وهو فن السيطرة والحجز. \n_ مدرسة (كيتو) ومؤسسها هو(تيرادا كان امون). \n_ مدرسة (كى اوشين )ومؤسسها(انيو جامى ناجا كاتسو). \n_ مدرسة (يوشين وميورا) كمدرستين ذات شهرة كبيرة جدا فى اليابان ونال اثنين من مدرسيها شهرة كبيرة جدا وهم (توشوكا )و(اسوماتا يوشين) وكان الهدف من ممارستها هو المحافظة على الحياة من التعرض للمخاطر والاعداد البدني وتقوية الجسم .\'"),
        "screen1subtitle1": MessageLookupByLibrary.simpleMessage("الجوجيتسو"),
        "screen1subtitle10": MessageLookupByLibrary.simpleMessage(
            "ز- الجودو يحقق الكثير من الاهداف التربوية:-"),
        "screen1subtitle11":
            MessageLookupByLibrary.simpleMessage("ح- الجودو رياضة للجميع:-"),
        "screen1subtitle2": MessageLookupByLibrary.simpleMessage("الجودو"),
        "screen1subtitle3": MessageLookupByLibrary.simpleMessage(
            "الجودو رياضة الفوائد المتنوعه"),
        "screen1subtitle4":
            MessageLookupByLibrary.simpleMessage("أ-التنمية الجسدية:"),
        "screen1subtitle5":
            MessageLookupByLibrary.simpleMessage("ب-التنمية العقلية:"),
        "screen1subtitle6":
            MessageLookupByLibrary.simpleMessage("جـ - الدفاع عن النفس:"),
        "screen1subtitle7":
            MessageLookupByLibrary.simpleMessage("د - الجودو نشاط ترويحي:"),
        "screen1subtitle8": MessageLookupByLibrary.simpleMessage(
            "هـ - الاستخدام الامثل للقوى:-"),
        "screen1subtitle9": MessageLookupByLibrary.simpleMessage(
            "و- الجودو يعمل على تحقيق الجوانب النفسية:-"),
        "screen2text1": MessageLookupByLibrary.simpleMessage(
            "الاوضاع الاساسية في رياضة الجودو:-"),
        "screen2text10": MessageLookupByLibrary.simpleMessage(
            "الوقفة الهجومية ( شيزن هون تاي):-"),
        "screen2text11": MessageLookupByLibrary.simpleMessage(
            "ونقوم بها بحيث تكون القدمين متباعدين باتساع الحوض ويكون الجسم علي استقامة واحدة والنظر للامام وفي حالة وجود القدم اليمني اماماً تسمي وقفة هجومية يمين ( ميجي شيزن هون تاي) وعند وجود القدم اليسري اماماً تسمي وقفة هجومية يسار (هيداري شيزن هون تاي)  كما بالشكل التالي:-"),
        "screen2text12": MessageLookupByLibrary.simpleMessage(
            "الوقفة الدفاعية ( جيجو هون تاي):-"),
        "screen2text13": MessageLookupByLibrary.simpleMessage(
            "ونقوم بها بحيث تكون القدمين متباعدين باتساع الحوض ويكون الجسم علي استقامة واحدة والنظر للامام وفي حالة وجود القدم اليمني اماماً تسمي وقفة هجومية يمين ( ميجي شيزن هون تاي) وعند وجود القدم اليسري اماماً تسمي وقفة هجومية يسار (هيداري شيزن هون تاي)  كما بالشكل التالي:-"),
        "screen2text14":
            MessageLookupByLibrary.simpleMessage("رابعاً:مسك البدلة:-"),
        "screen2text15": MessageLookupByLibrary.simpleMessage(
            "هناك عدة طرق لمسك البدلة وهي:-"),
        "screen2text16": MessageLookupByLibrary.simpleMessage(
            "الطريقة الاولى: مسك ياقة الجاكت من أعلى باليد اليمين أسفل الذقن ومسك كم البدلة باليد اليسرى من عند الكوع (في حالة الوقفة الهجومية اليمين)"),
        "screen2text17": MessageLookupByLibrary.simpleMessage(
            "الطريقة الثانية: عكس السابقة (في حالة الوقفة الهجومية شمال)"),
        "screen2text18": MessageLookupByLibrary.simpleMessage(
            "الطريقة الثالثة: مسك ياقة البدلة من خلف رقبة المنافس باليد اليسرى. ومسك كم البدلة باليد اليمني من عند مفصل الكوع (في حالة الوقفة الهجومية شمال)"),
        "screen2text19": MessageLookupByLibrary.simpleMessage(
            "الطريقة الرابعة: عكس السابقة في حالة الوقفة الهجومية يمين"),
        "screen2text2": MessageLookupByLibrary.simpleMessage(
            "تعتبر الاوضاع الاساسية هى العمود الفقرى لاى اداء رياضى يمكن ان يتحقق فى محيط اللعبة و بذلك يمكن التقدم بالمستوى التدريبى للفرد فبدون هذه الآوضاع لا ننتظر أن يتحقق أى مستوى عالى لنصل إلى مستوى البطولة و تعتبر الآوضاع الأساسية الركيزة الأساسية التى يعتمد عليها اللاعب خلال عمره التدريبي ."),
        "screen2text20": MessageLookupByLibrary.simpleMessage(
            "الطريقة الخامسة: يمسك اللاعب البدلة من الياقة بكلتا اليدين واحدة في الناحية اليسرى واخرى في الناحية اليمنى"),
        "screen2text21": MessageLookupByLibrary.simpleMessage(
            "الطريقة السادسة: يمسك اللاعب ياقة الجاكيت والكم من جانب واحد وفي هذه الحالة يجب ان يستخدم هجوم قبل مرور خمس ثواني والا تعرض للإنذار"),
        "screen2text22": MessageLookupByLibrary.simpleMessage(
            "وهناك بعض الجوانب التكتيكية التى يجب أن يراعيها المدرب عند تعليم اللاعبين مسكة البدلة:-"),
        "screen2text23": MessageLookupByLibrary.simpleMessage(
            "1.أن تكون المسكة قوية و محكمة و لها القدرة فى السيطرة و التحكم فى حركة الخصم للامام و الخلف الى أعلى و الى الجانبين."),
        "screen2text24": MessageLookupByLibrary.simpleMessage(
            "2.تعتبر المسكة وسيلة إتصال حساسة جدا تشعر بأى حركة يزعم الخصم تنفيذها أو أى محاولة يقوم بها الخصم لتغيير اتجاهه."),
        "screen2text25": MessageLookupByLibrary.simpleMessage(
            "4.يجب على المدرب أن يراعى أن يكون هناك فراغ بين المسكة و جسم اللاعب عند أداء الحركة حتى لايتسبب ذلك فى فقدان جزء كبير من قوة اللاعب و تؤثر بالتالى على الاداء"),
        "screen2text26": MessageLookupByLibrary.simpleMessage(
            "3.يجب على المدرب أن يوجه اللاعب الى العادات الخاطئة عند مسكة البدلة حتى لايضرون انفسهم عند السقوط على الارض أو خطف الحركة و يوضح لهم كيفية التخلص منها."),
        "screen2text27": MessageLookupByLibrary.simpleMessage(
            "5.أن يراعى المدرب تغيير أوضاع الذراعيين فى مسكة البدلة حيث هناك طرق أخرى للمسك مثال ذلك:المسكة باليد اليمنى من كم الجاكت الايسر بدلآمن الياقة أمام الصدر أو المسك بنفس الذراع من الياقة خلف الرقبة تماما أو مسك السترة باليديين من أسفل الابطين."),
        "screen2text28": MessageLookupByLibrary.simpleMessage(
            "6.لكل حركة مسكة خاصة بها تختلف من حركة الى أخرى ومن تكتيك لاخر كما أنها تختلف حسب طول ووزن اللاعب الذى يواجهه فاللاعب الطويل يختلف عن اللاعب القصير و هكذا."),
        "screen2text29": MessageLookupByLibrary.simpleMessage(
            "7.يجب على المدرب تدريب اللاعب على مسكات التى لاتحتاج الى وقت طويل حتى يمكنة تنفيذ الحركة فى أسرع وقت ولا يضطر الحكم الى توجية انذار اليةمثال ذلك: المسكات التى تتيح للاعب فرصة 5ثوانى فقط مثل مسك البدلة للخصم من السترة و الكم فى نفس الجهه."),
        "screen2text3": MessageLookupByLibrary.simpleMessage(
            "والاوضاع الاساسية في رياضة الجودو هي :-"),
        "screen2text30": MessageLookupByLibrary.simpleMessage(
            "8.يجب ملاحظة أن تختلف مسكة البدلة فى الوضع الدفاعى عنة فى الوضع الهجومى عنه فى الوضع الطبيعى للعب وهذه تختلف تبعا للمتغيرات الدفاعية و الهجومية أثناء اللعب مع الخصم."),
        "screen2text31": MessageLookupByLibrary.simpleMessage(
            "خامساً:طرق واتجاهات اخلال التوازن:-"),
        "screen2text32": MessageLookupByLibrary.simpleMessage(
            "وهناك عدة اتجاهات لاخلال التوازن وهي:-"),
        "screen2text33_1":
            MessageLookupByLibrary.simpleMessage("إخلال توازن المنافس للأمام"),
        "screen2text33_2":
            MessageLookupByLibrary.simpleMessage("إخلال توازن المنافس للخلف."),
        "screen2text33_3": MessageLookupByLibrary.simpleMessage(
            "اخلال توازن المنافس للجانب الايمن."),
        "screen2text33_4": MessageLookupByLibrary.simpleMessage(
            "إخلال توازن المنافس للجانب الايسر."),
        "screen2text33_5": MessageLookupByLibrary.simpleMessage(
            "إخلال توازن المنافس للأمام وللجانب الايمن."),
        "screen2text33_6": MessageLookupByLibrary.simpleMessage(
            "إخلال توازن المنافس للأمام وللجانب الايسر."),
        "screen2text33_7": MessageLookupByLibrary.simpleMessage(
            "إخلال توازن المنافس للخلف وللجانب الايسر."),
        "screen2text33_8": MessageLookupByLibrary.simpleMessage(
            "إجلال توازن المنافس للخلف وللجانب الايمن."),
        "screen2text35":
            MessageLookupByLibrary.simpleMessage("سادساً:السقطات(اوكيمي):-"),
        "screen2text36":
            MessageLookupByLibrary.simpleMessage("وتنقسم تلك السقطات إلي:-"),
        "screen2text37_1":
            MessageLookupByLibrary.simpleMessage("السقطة الخلفية"),
        "screen2text37_2": MessageLookupByLibrary.simpleMessage(
            "السقطة الجانبية( يمين و شمال )."),
        "screen2text37_3":
            MessageLookupByLibrary.simpleMessage("السقطة الامامية."),
        "screen2text37_4":
            MessageLookupByLibrary.simpleMessage("السقطة الامامية الدائرية."),
        "screen2text4_1": MessageLookupByLibrary.simpleMessage("التحية"),
        "screen2text4_2":
            MessageLookupByLibrary.simpleMessage("التحرك على البساط"),
        "screen2text4_3":
            MessageLookupByLibrary.simpleMessage("الوقوف على البساط"),
        "screen2text4_4": MessageLookupByLibrary.simpleMessage("مسك البدلة"),
        "screen2text4_5":
            MessageLookupByLibrary.simpleMessage("اخلال توازن المنافس"),
        "screen2text4_6":
            MessageLookupByLibrary.simpleMessage("السقوط على البساط"),
        "screen2text5": MessageLookupByLibrary.simpleMessage("اولا:التحية:-"),
        "screen2text6":
            MessageLookupByLibrary.simpleMessage("التحية من أعلي (تاتش ريه)"),
        "screen2text6_1":
            MessageLookupByLibrary.simpleMessage("السقوط على البساط"),
        "screen2text6_2":
            MessageLookupByLibrary.simpleMessage("يقف المتسابقين وجها لوجه"),
        "screen2text6_3": MessageLookupByLibrary.simpleMessage(
            "القدمين مضمومتين والمشطين متباعدين"),
        "screen2text6_4": MessageLookupByLibrary.simpleMessage(
            "تكون التحية بميل الجذع للأمام قليلا مع تحريك اليدين من الجانب"),
        "screen2text6_5":
            MessageLookupByLibrary.simpleMessage("النظر يكون على المنافس"),
        "screen2text6_6":
            MessageLookupByLibrary.simpleMessage("العودة لوضع الوقوف مرة أخرى"),
        "screen2text7":
            MessageLookupByLibrary.simpleMessage("التحية من أسفل (سيزارية)"),
        "screen2text7_1": MessageLookupByLibrary.simpleMessage(
            "من الوقوف ضع الركبة اليسرى على الارض"),
        "screen2text7_2": MessageLookupByLibrary.simpleMessage(
            "ضع الركبة اليمين بجانب اليسرى"),
        "screen2text7_3": MessageLookupByLibrary.simpleMessage(
            "ضع مشط القدم اليسرى على اليمين"),
        "screen2text7_4":
            MessageLookupByLibrary.simpleMessage("الجلوس بالمقعدة على القدمين"),
        "screen2text7_5": MessageLookupByLibrary.simpleMessage(
            "تكون التحية بميل الجذع للأمام مع وضع اليدين على البساط والنظر على المنافس الاخر"),
        "screen2text7_6": MessageLookupByLibrary.simpleMessage(
            "الرجوع لوضع السيزا بعد أداء التحية"),
        "screen2text7_7":
            MessageLookupByLibrary.simpleMessage("الرجوع لوضع الجثو"),
        "screen2text7_8":
            MessageLookupByLibrary.simpleMessage("فك امشاط القدمين"),
        "screen2text7_9": MessageLookupByLibrary.simpleMessage(
            "يقف اللاعب على القدم اليمين اولا ثم القدم اليسرى للوصول لوضع الوقوف"),
        "screen2text8":
            MessageLookupByLibrary.simpleMessage("ثانياً:الوقفات:-"),
        "screen2text9": MessageLookupByLibrary.simpleMessage(
            "تعتبر الوقفات من الاساسيات الهامة في رياضة الجودو لان الوقوف الصحيح علي البساط يساعد اللاعب علي الهجوم والدفاع بطريقة سهلة وهناك نوعان من الوقفات هما :-"),
        "screen3dialog1": MessageLookupByLibrary.simpleMessage(
            "لرياضة الجودو تقاليد عريقة عرفت منذ قديم الزمن ورثت عن اليابانيين القدماء الى جانب قانون ينظم ممارسها ومن هذة التقاليد ما ينص عليها القانون صريحة ومنها مالم ينص عليه القانون ولكنة فى نفس الوقت قوة القانون ومن اهم هذة التقاليد."),
        "screen3dialog10": MessageLookupByLibrary.simpleMessage(
            "يجب ان يكون البساط المعد للتدريب نظيفا بإستمرار."),
        "screen3dialog11": MessageLookupByLibrary.simpleMessage(
            "على اللاعب عدم التهور فى استعمال فنون اللعبةاثناءالتدريب او المنافسة."),
        "screen3dialog2": MessageLookupByLibrary.simpleMessage(
            "ضرورة احترام مكان التدريب (دوجو) فى جميع الاوقات تماما كاحترامنا لمنزلنا والأماكن المستحقة للإحترام."),
        "screen3dialog3": MessageLookupByLibrary.simpleMessage(
            "ضرورة الاحتفاظ بالاقدام نظيفة وعدم ارتداء احذية على البساط كما يجب ارتداء(شبشب حمام) خارج البساط حتى لا تتعلق الاتربة بالقدمين."),
        "screen3dialog4": MessageLookupByLibrary.simpleMessage(
            "تأدية التحية عند دخول البساط و الخروج منه كذلك تؤدى التحية عند الخروج من الصالة وعند اللعب مع الزميل و للجنة المنظمة للبطولة وقبل و بعد المباراة (شياى) او اثناء التدريب و التمرين (راندورى) ويجب أن تكون التحية المشروعة."),
        "screen3dialog5": MessageLookupByLibrary.simpleMessage(
            "يجب ان يكون الجلوس على البساط اثناء التدريب و المسابقات فى شكل موحد للعادات اليابانية (جلوس الجثو- الجلوس تربيع.("),
        "screen3dialog6": MessageLookupByLibrary.simpleMessage(
            "يجب على اللاعب احترام مدربيه و يطيع تعليماتهم وارشاداتهم و يكن لهم الولاء ولايعترض على قرارات الحكم."),
        "screen3dialog7": MessageLookupByLibrary.simpleMessage(
            "يجب الاهتمام بالنظافة الشخصية و منها الاهتمام بنظافة البدلة وان تكون اظافر اليديين و القدمين قصيرة."),
        "screen3dialog8": MessageLookupByLibrary.simpleMessage(
            "عدم ارتداء اى جسم صلب كالخواتم والساعات واساور المعصم التى تعرض المنافس للخطر."),
        "screen3dialog9": MessageLookupByLibrary.simpleMessage(
            "التاكد من سلامة اللاعب وذلك بإجراءالكشف الطبى الدورى للتأكد من خلوه من الامراض المعدية."),
        "screen3title": MessageLookupByLibrary.simpleMessage(
            "اداب و تقاليد رياضة الجودو:-"),
        "screen4descreption1": MessageLookupByLibrary.simpleMessage(
            "يجب علينا قبل البدء في التدريب او المنافسة ارتداء البدلة جيداً وسوف نعرض طريقة ارتداء البدلة ويجب ارتداء البنطلون اولاً ثم السترة ثم الحزام كما بالطريقة التالية:-"),
        "screen4subtitle1": MessageLookupByLibrary.simpleMessage(
            "طريقة إرتداء بنطلون الجودو \'زوبون\':-"),
        "screen4subtitle2": MessageLookupByLibrary.simpleMessage(
            "طريقة إرتداء الجاكت \'يواجي\':-"),
        "screen4subtitle3": MessageLookupByLibrary.simpleMessage(
            " طريقة ربط الحزام \'اوبي\':-"),
        "screen4subtitle4":
            MessageLookupByLibrary.simpleMessage(" طريقة تطبيق بدلة الجودو:-"),
        "screen4subtitle5":
            MessageLookupByLibrary.simpleMessage(" طريقة تطبيق بدلة الجودو:-"),
        "screen4title":
            MessageLookupByLibrary.simpleMessage("طريقة ارتداء بدلة الجودو:-"),
        "screen4topic1": MessageLookupByLibrary.simpleMessage(
            "• يتم سحب ربطي البنطلون من الخلف كما بالشكل."),
        "screen4topic10": MessageLookupByLibrary.simpleMessage(
            "ثم نقوم بلف البدلة عن طريق الدوران كما بالشكل التالي:-"),
        "screen4topic11": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-ثم نقوم بربط الحزام كما بالشكل التالي:-"),
        "screen4topic12": MessageLookupByLibrary.simpleMessage(
            " لا يسمح للاعب بإرتداء إي ملابس إسفل جات الجودو\'يواجي\' و البنات فقط يرتدون تي شرت ابيض إسفل اليواجي."),
        "screen4topic2": MessageLookupByLibrary.simpleMessage(
            "• يتم سحب ربطي البنطلون من الخلف كما بالشكل."),
        "screen4topic3": MessageLookupByLibrary.simpleMessage(
            "• يتم ربط الرباطين من الامام مع بعضيهما كما بالشكل:-"),
        "screen4topic4": MessageLookupByLibrary.simpleMessage(
            "• يتم وضع الطرف الايمن من الجاكت ثم يوضع علية الطرف الايسر من الجاكت بحيث تظهر علامة صنع البدلة من إسفل الجاكت كما بالشكل:-"),
        "screen4topic5": MessageLookupByLibrary.simpleMessage(
            "• يتم وضع منتصف الحزام عند البطن عند السرة تقريباً من الامام كما بالشكل :-"),
        "screen4topic6": MessageLookupByLibrary.simpleMessage(
            "• يلف الحزام حول الوسط من الخلف ثم إلي الامام كما بالشكل التالي :-"),
        "screen4topic7": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال للحزام علي الطرف اليمين وندخلة من اسفل اللفتين للحزام من الامام حيث يصبح الطرف الشمال أعلي والطرف اليمين اسفل كما بالشكل :-"),
        "screen4topic8": MessageLookupByLibrary.simpleMessage(
            "• ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-"),
        "screen4topic9": MessageLookupByLibrary.simpleMessage(
            "يتم تطبيق البدلة كما بالشكل التالي :-"),
        "screen5subtitle1": MessageLookupByLibrary.simpleMessage(
            "نماذج لتدريبات الإحماء تستخدم في رياضة الجودو:"),
        "screen5subtitle2":
            MessageLookupByLibrary.simpleMessage("تمرينات الساقين: "),
        "screen5subtitle3": MessageLookupByLibrary.simpleMessage(
            " نماذج لإحماء بتمرينات يقوم بها أكثر من لاعب:"),
        "screen5subtitle4":
            MessageLookupByLibrary.simpleMessage("تدريبات الإحماء العادي:"),
        "screen5title": MessageLookupByLibrary.simpleMessage(
            "لما الاحماء (التسخين )مهم للاعبين الجودو:-"),
        "screen5topic1": MessageLookupByLibrary.simpleMessage(
            "1 ـ تمرينات الرقبة : ثني الرقبة من اليمين إلى اليسار أو العكس أو إلى الخلف ودوران الرأس من اليمين إلى اليسار. \n 2 ـ  تمرينات الذراعين : مرجحة الذراعين أماماً أسفل وجانباً , وضع الكفين أمام الصدر ونضغط المرفقين جانباً, وحركات دائرة بالذراعين برفعهم جانباً. \n 3 ـ تمرينات الجذع : الوقوف والذراعان عالياً وضغط الجذع والذراعان خلفاً ويكرر التدريب في وضع الجلوس , والوقوف والذراع أماما وضغط الجذع إلى الجانبين وبالتبادل بضغط الجذع أماما والى اسمع بمحاولة لمس الأرض بالجبهة. \n "),
        "screen5topic2": MessageLookupByLibrary.simpleMessage(
            "  الوقوف والذراعان جانباً ومرجعة الساقين جانبا ً , الوقوف والذراعان أماما ومرجعة الساقين أماما عالياً بالتبادل لمحاولة لمس اليدين مع مراعاة التدرج في التدريب , والجلوس ومد الساقين للأمام ورفع الركبة عالياً للمس الصدر بمساعدة اليدين , والوقوف وثني الركبتين كاملاً ثم مدهما."),
        "screen5topic3": MessageLookupByLibrary.simpleMessage(
            "1.تمرينات الرقبة : يحاول كل لاعب جذب رقبة اللاعب الأخر بيد واحدة. \n 2.تمرينات للذراعين : يقف اللاعبان وجهاً لوجه وأيديهما متشابكة أمام الصدر , ويؤدى   التمرين بثني الذراعين ومدهما. \n 3.تمرينات للجذع : يقف لاعبان والذراعان عالياً وظهر كل منهما للأخر وبينهما مسافة مناسبة , ويؤدى التمرين بثنى الجذع أماما والى أسفل مع محاولة تشابك الأيدي لزيادة ضغط الجذع إلى الخلف , يقف اللاعبان وجهاً لوجه مع تشابك ذراع احدهما بذراع الأخر , ورفع الذراع الأخرى عالياً , ويؤدى التدريب بان يجذب كل منهما الأخر مع قذف الذراع العلياً إلى الخلف. \n 4.تمرينات للساقين : يقف لاعبان وجهاً لوجه ويمسك كل منهما بيده ساق الأخر ويؤدى التدريب بالحجل على رجل واحدة , كما يقف لاعبان ظهر كل منهما للأخر , مع رفع الذراعين أماما ويؤدى التدريب بثي إحدى الركبتين ثنياً كاملاً ومد الساق الأخرى . \n "),
        "screen5topic4": MessageLookupByLibrary.simpleMessage(
            "1-المشي على المشطين . \n 2-المشي على كعب القدم . \n 3-المشي على الجانب الخارجي للقدم ثم الداخلي. \n 4-المشي مع ثني الركبتين قليلا . \n 5-المشي بخطوات طويلة . \n 6-المشي مع محاولة لمس الصدر بالركبة  . \n 7-المشي بخطوات سريعة مع حركات دائرية للذراعين . \n 8-المشي مع ثني الجذع أماما والى أسفل ولمس الأرض باليدين  المشي على ساق واحدة مع مسك مفصل القدم الأخرى بإحدى اليدين ثم التبديل . \n 9-الجري مع ثني الركبتين . \n 10-الوثب أماما ثم خلفاً . \n 11-الحجل على إحدى الساقين لمسافة معينة ثم التبديل للحجل على الأخرى . \n 12-الجري في اتجاه معكوس . \n 13-الجري ثم الجلوس أو الرقود ثم الجري مرة أخرى عند إشارة المدرب . \n 14-الجري مع أداء بعض حركات الخداع والتمويه. \n 15-الجري السريع ثم الوقوف مباشرة مع أشارة المدرب . \n 16-الجري السريع مع تبديل الاتجاه عند سماع إشارة المدرب . \n 17-الجري السريع ثم الارتماء على البطن عند إشارة المدرب . \n 18-الجري ثم الوثب بقدم واحدة والوثب بالقدمين معاً \n 19-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب. \n 20-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب. \n "),
        "screen6title": MessageLookupByLibrary.simpleMessage(
            "بعض مهارات الرمي من أعلي في رياضة الجودو:-"),
        "screen6type1": MessageLookupByLibrary.simpleMessage("دي اشي براي"),
        "screen6type10": MessageLookupByLibrary.simpleMessage("كو اتشي جاري"),
        "screen6type11": MessageLookupByLibrary.simpleMessage("كوتشي جوروما"),
        "screen6type12":
            MessageLookupByLibrary.simpleMessage("تسوري كومي جوشي"),
        "screen6type13":
            MessageLookupByLibrary.simpleMessage("اوكورية آشي هراي"),
        "screen6type14": MessageLookupByLibrary.simpleMessage("تاي اوتوشي"),
        "screen6type15": MessageLookupByLibrary.simpleMessage("هراي جوشي"),
        "screen6type16": MessageLookupByLibrary.simpleMessage("اوتشي ماتا"),
        "screen6type17": MessageLookupByLibrary.simpleMessage("كوسوتو جاكي"),
        "screen6type18": MessageLookupByLibrary.simpleMessage("تسوري جوشي"),
        "screen6type19": MessageLookupByLibrary.simpleMessage("يوكو اوتوشي"),
        "screen6type2": MessageLookupByLibrary.simpleMessage("هيزا جوروما"),
        "screen6type20": MessageLookupByLibrary.simpleMessage("آشي جوروما"),
        "screen6type21": MessageLookupByLibrary.simpleMessage("هاني جوشي"),
        "screen6type22":
            MessageLookupByLibrary.simpleMessage("هراي تسوريكومي آشي"),
        "screen6type23": MessageLookupByLibrary.simpleMessage("تومي ناجي"),
        "screen6type24": MessageLookupByLibrary.simpleMessage("كاتا جوروما"),
        "screen6type25": MessageLookupByLibrary.simpleMessage("سومي جاتشي"),
        "screen6type26": MessageLookupByLibrary.simpleMessage("تاني أوتوشي"),
        "screen6type27": MessageLookupByLibrary.simpleMessage("هاني ماكي كومي"),
        "screen6type28": MessageLookupByLibrary.simpleMessage("سوكوي ناجي"),
        "screen6type29": MessageLookupByLibrary.simpleMessage("تسوري جوشي"),
        "screen6type3":
            MessageLookupByLibrary.simpleMessage("ساساي تسوريكومي آشي"),
        "screen6type30": MessageLookupByLibrary.simpleMessage("أو جروما"),
        "screen6type31": MessageLookupByLibrary.simpleMessage("سوتو ماكيكومي"),
        "screen6type32": MessageLookupByLibrary.simpleMessage("اوكي اوتوشي"),
        "screen6type33": MessageLookupByLibrary.simpleMessage("أوسوتر جوروما"),
        "screen6type34": MessageLookupByLibrary.simpleMessage("أوكي وازا"),
        "screen6type35": MessageLookupByLibrary.simpleMessage("يكو وكاري"),
        "screen6type36": MessageLookupByLibrary.simpleMessage("يوكو جوروما"),
        "screen6type37": MessageLookupByLibrary.simpleMessage("أوشيرو جوشي"),
        "screen6type38": MessageLookupByLibrary.simpleMessage("اورا ناجي"),
        "screen6type39": MessageLookupByLibrary.simpleMessage("سومي اوتوشي"),
        "screen6type4": MessageLookupByLibrary.simpleMessage("اوكي جوشي"),
        "screen6type40": MessageLookupByLibrary.simpleMessage("يوكو جاكي"),
        "screen6type41": MessageLookupByLibrary.simpleMessage("مروتيه سيوناجي"),
        "screen6type42": MessageLookupByLibrary.simpleMessage("مروتيه جاري"),
        "screen6type43": MessageLookupByLibrary.simpleMessage("ياماراشي"),
        "screen6type44": MessageLookupByLibrary.simpleMessage("اوستو اوتوشي"),
        "screen6type45": MessageLookupByLibrary.simpleMessage("تسمبا جيشي"),
        "screen6type46":
            MessageLookupByLibrary.simpleMessage("هاني جوشي جايشي"),
        "screen6type5": MessageLookupByLibrary.simpleMessage("اوسوتو جاري"),
        "screen6type6": MessageLookupByLibrary.simpleMessage("او جوشي"),
        "screen6type7": MessageLookupByLibrary.simpleMessage("او اتشي جاري"),
        "screen6type8": MessageLookupByLibrary.simpleMessage("ايبون سيو ناجي"),
        "screen6type9": MessageLookupByLibrary.simpleMessage("كوسوتو جاري"),
        "screen7arabicterm1": MessageLookupByLibrary.simpleMessage("لاعب جودو"),
        "screen7arabicterm10": MessageLookupByLibrary.simpleMessage("قدم"),
        "screen7arabicterm11":
            MessageLookupByLibrary.simpleMessage("معلم/ مدرب"),
        "screen7arabicterm12":
            MessageLookupByLibrary.simpleMessage("التحية من الوقوف"),
        "screen7arabicterm13":
            MessageLookupByLibrary.simpleMessage("التحية من اسفل"),
        "screen7arabicterm14":
            MessageLookupByLibrary.simpleMessage("الوقفة الطبيعية"),
        "screen7arabicterm15":
            MessageLookupByLibrary.simpleMessage("الوقفة الطبيعية يمين"),
        "screen7arabicterm16":
            MessageLookupByLibrary.simpleMessage("الوقفة الطبيعية شمال"),
        "screen7arabicterm17":
            MessageLookupByLibrary.simpleMessage("الوقفة الدفاعية"),
        "screen7arabicterm18":
            MessageLookupByLibrary.simpleMessage("الوقفة الدفاعية يمين"),
        "screen7arabicterm19":
            MessageLookupByLibrary.simpleMessage("الوقفة الدفاعية شمال"),
        "screen7arabicterm2":
            MessageLookupByLibrary.simpleMessage("الجاكت-السترة"),
        "screen7arabicterm20":
            MessageLookupByLibrary.simpleMessage("مسكة البدلة"),
        "screen7arabicterm21":
            MessageLookupByLibrary.simpleMessage("التحرك علي البساط"),
        "screen7arabicterm22":
            MessageLookupByLibrary.simpleMessage("أخلال التوازن"),
        "screen7arabicterm23": MessageLookupByLibrary.simpleMessage("السقطات"),
        "screen7arabicterm24":
            MessageLookupByLibrary.simpleMessage("السقطة الجانبية"),
        "screen7arabicterm25":
            MessageLookupByLibrary.simpleMessage("السقطة الخلفية"),
        "screen7arabicterm26":
            MessageLookupByLibrary.simpleMessage("السقطة الامامية الدائرية"),
        "screen7arabicterm27":
            MessageLookupByLibrary.simpleMessage("السقطة الامامية"),
        "screen7arabicterm28":
            MessageLookupByLibrary.simpleMessage("السقطة الجانبية شمال"),
        "screen7arabicterm29":
            MessageLookupByLibrary.simpleMessage("السقطة الجانبية يمين"),
        "screen7arabicterm3": MessageLookupByLibrary.simpleMessage("الحزام"),
        "screen7arabicterm30": MessageLookupByLibrary.simpleMessage("حكم"),
        "screen7arabicterm4": MessageLookupByLibrary.simpleMessage("البنطلون"),
        "screen7arabicterm5":
            MessageLookupByLibrary.simpleMessage("بدلة الجودو"),
        "screen7arabicterm6":
            MessageLookupByLibrary.simpleMessage("صالة الجودو"),
        "screen7arabicterm7": MessageLookupByLibrary.simpleMessage("البساط"),
        "screen7arabicterm8": MessageLookupByLibrary.simpleMessage("ايد"),
        "screen7arabicterm9":
            MessageLookupByLibrary.simpleMessage("وسط/ مقعدة"),
        "screen7japaneseterm1": MessageLookupByLibrary.simpleMessage("جودوكا"),
        "screen7japaneseterm10": MessageLookupByLibrary.simpleMessage("اشي"),
        "screen7japaneseterm11": MessageLookupByLibrary.simpleMessage("سنساي"),
        "screen7japaneseterm12": MessageLookupByLibrary.simpleMessage("رية"),
        "screen7japaneseterm13": MessageLookupByLibrary.simpleMessage("زا رية"),
        "screen7japaneseterm14":
            MessageLookupByLibrary.simpleMessage("شيزن تاي"),
        "screen7japaneseterm15":
            MessageLookupByLibrary.simpleMessage("ميجي شيزن تاي"),
        "screen7japaneseterm16":
            MessageLookupByLibrary.simpleMessage("هيداري شيزن تاي"),
        "screen7japaneseterm17":
            MessageLookupByLibrary.simpleMessage("جيجوتاي"),
        "screen7japaneseterm18":
            MessageLookupByLibrary.simpleMessage("ميجي جيجوتاي"),
        "screen7japaneseterm19":
            MessageLookupByLibrary.simpleMessage("هيداري جيجوتاي"),
        "screen7japaneseterm2": MessageLookupByLibrary.simpleMessage("يواجي"),
        "screen7japaneseterm20":
            MessageLookupByLibrary.simpleMessage("كومي كاتا"),
        "screen7japaneseterm21":
            MessageLookupByLibrary.simpleMessage("تاي سباكي"),
        "screen7japaneseterm22": MessageLookupByLibrary.simpleMessage("كوزوشي"),
        "screen7japaneseterm23": MessageLookupByLibrary.simpleMessage("اوكيمي"),
        "screen7japaneseterm24":
            MessageLookupByLibrary.simpleMessage("يوكو اوكيمي"),
        "screen7japaneseterm25":
            MessageLookupByLibrary.simpleMessage("اوشيروا اوكيمي"),
        "screen7japaneseterm26":
            MessageLookupByLibrary.simpleMessage("ماي مواري أوكيمي"),
        "screen7japaneseterm27":
            MessageLookupByLibrary.simpleMessage("ماي اوكيمي"),
        "screen7japaneseterm28":
            MessageLookupByLibrary.simpleMessage("هيداري يوكو اوكيمي"),
        "screen7japaneseterm29":
            MessageLookupByLibrary.simpleMessage("ميجي يوكو اوكيمي"),
        "screen7japaneseterm3": MessageLookupByLibrary.simpleMessage("أوبي"),
        "screen7japaneseterm30": MessageLookupByLibrary.simpleMessage("شينبان"),
        "screen7japaneseterm4": MessageLookupByLibrary.simpleMessage("زبون"),
        "screen7japaneseterm5": MessageLookupByLibrary.simpleMessage("جودوجي"),
        "screen7japaneseterm6": MessageLookupByLibrary.simpleMessage("دوجو"),
        "screen7japaneseterm7": MessageLookupByLibrary.simpleMessage("تاتامي"),
        "screen7japaneseterm8": MessageLookupByLibrary.simpleMessage("تي"),
        "screen7japaneseterm9": MessageLookupByLibrary.simpleMessage("جوشي"),
        "screen7num": MessageLookupByLibrary.simpleMessage("م"),
        "screen7subtitle1":
            MessageLookupByLibrary.simpleMessage("المصطلح باللغة العربية"),
        "screen7subtitle2":
            MessageLookupByLibrary.simpleMessage("المصطلح باللغة اليابانية"),
        "screen7subtitle3":
            MessageLookupByLibrary.simpleMessage("صورة توضيحية للمصطلح"),
        "screen7title": MessageLookupByLibrary.simpleMessage(
            "بعض المطلحات الخاصة برياضة الجودو :"),
        "splashscreendialog1":
            MessageLookupByLibrary.simpleMessage("التصميم بواسطة :"),
        "splashscreendialog2": MessageLookupByLibrary.simpleMessage(" "),
        "students":
            MessageLookupByLibrary.simpleMessage(" الطالب / احمد مصطفي"),
        "title": MessageLookupByLibrary.simpleMessage("اهلا وسهلا...")
      };
}
