Repository: YoussefM50/judo_app-main
Catalog: lib/l10n/intl_*.arb
Languages: ar

# scree5paragraph4
source: But if the body's systems are no longer adequately prepared to accept the maximum effort expected to be performed, then sports injuries can occur, or the first appearance of fatigue, which is called (psychosis). This phenomenon can continue with the player, so he is unable to perform his duty on the field.' Until the internal systems are organized and prepared to accept the effort required to be performed, then the player becomes ready to carry out his duties, that is, after he obtains his second breath.
ar: أما إذا لم تعد أجهزة الجسم الإعداد الكافي لتقبل أقصى الجهد المنظر أداءه , فيمكن أن تحدث إصابات الملاعب أو ما ظهر التعب الأولى التي تسمى (كرشة النفس ) . وهذه الظاهرة يمكن أن تستمر مع اللاعب فلا يتمكن من أداء واجبه في الملعب إلى أن تنتظم الأجهزة الداخلية وتعد لتقبل المجهود المطلوب أداؤه , ثم يصبح اللاعب مستعداً لتنفيذ واجباته , أي بعد حصوله على النفس الثاني.

# scree5paragraph5
source: The general warm-up is performed by walking, light running, some jumping movements, and physical exercises for flexibility and agility, as a comprehensive preparation for the various body systems, muscles, and joints. This part of the preparation is not sufficient to qualify the player to participate in matches or the main part of training and to perform fast running movements with the ball.' Or without it and camouflage movements, as for the special warm-up, it prepares the player in all the aspects mentioned, and prepares him for all the possibilities and movements that he performs in the matches in order to avoid field injuries.
ar: ويؤدى الإحماء العام بالمشي والجري الخفيف وبعض حركات الوثب والتمرينات البدنية الخاصة بالمرونة والرشاقة , وذلك كإعداد شامل لأجهزة الجسم وعضلاته ومفاصله المختلفة . وهذا القسم من الإعداد لا يكفي لتأهيل اللاعب للاشتراك في المباريات أو القسم الرئيسي من التدريب وأداء حركات الجري السريع بالكرة أو بدونها وحركات التمويه , إما الإحماء الخاص فيعمل على أعداد اللاعب في جميع النواحي التي تم ذكرها , وتهيئته جميع الاحتمالات والحركات التي يؤديها في المباريات حتى يتجنب إصابات الملاعب.

# scree5paragraph6
source: Therefore, it was necessary for the athlete to gradually decline in effort and movement so that the body's internal systems, in turn, could gradually perform their functions to keep pace with the athlete's effort and movement, since the energy of the body's systems to perform their functions is limited.
ar: ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة .

# screen5subtitle1
source: Models of warm-up exercises used in judo:
ar: نماذج لتدريبات الإحماء تستخدم في رياضة الجودو:

# screen5topic1
source: 1 - Neck exercises: bending the neck from right to left or vice versa or backwards and rotating the head from right to left. 2 - Arm exercises: swinging the arms forward, down and to the side, placing the palms in front of the chest and pressing the elbows to the side, and movements A circle with the arms by raising them to the side. 3 - Torso exercises: standing with the arms high and pressing the torso and arms behind. The training is repeated in a sitting position, standing with the arm in front and pressing the torso to the sides, and alternating by pressing the torso forward and to the ear by trying to touch the ground with the forehead.
ar: 1 ـ تمرينات الرقبة : ثني الرقبة من اليمين إلى اليسار أو العكس أو إلى الخلف ودوران الرأس من اليمين إلى اليسار. 2 ـ تمرينات الذراعين : مرجحة الذراعين أماماً أسفل وجانباً , وضع الكفين أمام الصدر ونضغط المرفقين جانباً, وحركات دائرة بالذراعين برفعهم جانباً. 3 ـ تمرينات الجذع : الوقوف والذراعان عالياً وضغط الجذع والذراعان خلفاً ويكرر التدريب في وضع الجلوس , والوقوف والذراع أماما وضغط الجذع إلى الجانبين وبالتبادل بضغط الجذع أماما والى اسمع بمحاولة لمس الأرض بالجبهة.

# screen5subtitle2
source: Leg exercises:
ar: تمرينات الساقين:

# screen5topic2
source: Standing with the arms to the side and returning the legs to the side. Standing with the arms in front and returning the legs high in front, taking turns trying to touch the hands while taking into account the progression in training. Sitting and extending the legs forward and raising the knee high to touch the chest with the help of the hands. Standing and bending the knees completely and then extending them.
ar: الوقوف والذراعان جانباً ومرجعة الساقين جانبا ً , الوقوف والذراعان أماما ومرجعة الساقين أماما عالياً بالتبادل لمحاولة لمس اليدين مع مراعاة التدرج في التدريب , والجلوس ومد الساقين للأمام ورفع الركبة عالياً للمس الصدر بمساعدة اليدين , والوقوف وثني الركبتين كاملاً ثم مدهما.

# screen5subtitle3
source: Samples of warm-up exercises performed by more than one player:
ar: نماذج لإحماء بتمرينات يقوم بها أكثر من لاعب:

# screen5topic3
source: 1. Neck exercises: Each player tries to grab the other player's neck with one hand. 2. Arm exercises: The two players stand face to face with their hands clasped in front of the chest, and the exercise is performed by bending and extending the arms. 3. Torso exercises: standing Two players with their arms high and their backs to each other, with an appropriate distance between them. The exercise is performed by bending the torso forward and down while trying to interlock the hands to increase the pressure of the torso backwards. The two players stand face to face with one’s arm interlocking with the other’s arm, and raising the other arm high. The exercise is performed by pulling each of them The other with the upper arm thrown back. 4. Exercises for the legs: Two players stand face to face and each one holds the other’s leg with his hand and the exercise is performed with the stone on one leg. Two players also stand with their backs to each other, with the arms raised in front of them and the training is performed by bending one knee Completely and extend the other leg.
ar: 1.تمرينات الرقبة : يحاول كل لاعب جذب رقبة اللاعب الأخر بيد واحدة. 2.تمرينات للذراعين : يقف اللاعبان وجهاً لوجه وأيديهما متشابكة أمام الصدر , ويؤدى التمرين بثني الذراعين ومدهما. 3.تمرينات للجذع : يقف لاعبان والذراعان عالياً وظهر كل منهما للأخر وبينهما مسافة مناسبة , ويؤدى التمرين بثنى الجذع أماما والى أسفل مع محاولة تشابك الأيدي لزيادة ضغط الجذع إلى الخلف , يقف اللاعبان وجهاً لوجه مع تشابك ذراع احدهما بذراع الأخر , ورفع الذراع الأخرى عالياً , ويؤدى التدريب بان يجذب كل منهما الأخر مع قذف الذراع العلياً إلى الخلف. 4.تمرينات للساقين : يقف لاعبان وجهاً لوجه ويمسك كل منهما بيده ساق الأخر ويؤدى التدريب بالحجل على رجل واحدة , كما يقف لاعبان ظهر كل منهما للأخر , مع رفع الذراعين أماما ويؤدى التدريب بثي إحدى الركبتين ثنياً كاملاً ومد الساق الأخرى .

# screen5subtitle4
source: Normal warm-up exercises:
ar: تدريبات الإحماء العادي:

# screen5topic4
source: 1-Walking on the balls of the foot. 2-Walking on the heel of the foot. 3-Walking on the outer side of the foot, then the inner. 4-Walking with the knees slightly bent. 5-Walking with long steps. 6- Walking while trying to touch the chest with the knee. 7- Walking in quick steps with circular movements of the arms. 8- Walking with the torso bent forward and down and touching the ground with the hands. Walking on one leg while holding the joint of the other foot with one hand, then switching 9-Running with the knees bent. 10-Jumping forward and then backward. 11-Jumping on one leg for a certain distance and then switching to jumping on the other. 12-Running in the opposite direction. 13-Running then Sit or lie down, then run again at the coach’s signal. 14- Running while performing some deception and camouflage movements. 15- Fast running and then standing immediately at the coach’s signal. 16- Fast running while changing direction when hearing the coach’s signal. 17- Running fast, then jumping on the stomach at the coach’s signal. 18- Running, then jumping with one foot and jumping with both feet. 19- Running forward, then jumping high, and squatting when hearing the coach’s signal. 20- Running forward, then jumping High up and squat down when you hear the coach's signal.
ar: 1-المشي على المشطين . 2-المشي على كعب القدم . 3-المشي على الجانب الخارجي للقدم ثم الداخلي. 4-المشي مع ثني الركبتين قليلا . 5-المشي بخطوات طويلة . 6-المشي مع محاولة لمس الصدر بالركبة . 7-المشي بخطوات سريعة مع حركات دائرية للذراعين . 8-المشي مع ثني الجذع أماما والى أسفل ولمس الأرض باليدين المشي على ساق واحدة مع مسك مفصل القدم الأخرى بإحدى اليدين ثم التبديل . 9-الجري مع ثني الركبتين . 10-الوثب أماما ثم خلفاً . 11-الحجل على إحدى الساقين لمسافة معينة ثم التبديل للحجل على الأخرى . 12-الجري في اتجاه معكوس . 13-الجري ثم الجلوس أو الرقود ثم الجري مرة أخرى عند إشارة المدرب . 14-الجري مع أداء بعض حركات الخداع والتمويه. 15-الجري السريع ثم الوقوف مباشرة مع أشارة المدرب . 16-الجري السريع مع تبديل الاتجاه عند سماع إشارة المدرب . 17-الجري السريع ثم الارتماء على البطن عند إشارة المدرب . 18-الجري ثم الوثب بقدم واحدة والوثب بالقدمين معاً 19-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب. 20-الجري أماما ثم الوثب عالياً والجلوس القرفصاء عند سماع إشارة المدرب.

# screen3title
source: Judo etiquette and traditions :
ar: اداب و تقاليد رياضة الجودو:-

# screen3dialog1
source: The sport of judo has long traditions that have been known since ancient times and were inherited from the ancient Japanese, along with a law that regulates its practitioners. Among these traditions are what the law explicitly stipulates, including what is not stipulated by the law, but at the same time it is the force of the law and one of the most important of these traditions.
ar: لرياضة الجودو تقاليد عريقة عرفت منذ قديم الزمن ورثت عن اليابانيين القدماء الى جانب قانون ينظم ممارسها ومن هذة التقاليد ما ينص عليها القانون صريحة ومنها مالم ينص عليه القانون ولكنة فى نفس الوقت قوة القانون ومن اهم هذة التقاليد.

# screen3dialog2
source: The need to respect the training place (dojo) at all times, just as we respect our home and places that deserve respect.
ar: ضرورة احترام مكان التدريب (دوجو) فى جميع الاوقات تماما كاحترامنا لمنزلنا والأماكن المستحقة للإحترام.

# screen3dialog3
source: The need to keep the feet clean and not to wear shoes on the rug, and it is also necessary to wear (bath slippers) outside the rug so that the dust does not stick to the feet.
ar: ضرورة الاحتفاظ بالاقدام نظيفة وعدم ارتداء احذية على البساط كما يجب ارتداء(شبشب حمام) خارج البساط حتى لا تتعلق الاتربة بالقدمين.

# screen3dialog4
source: Performing salutations when entering and exiting the rug. The salutation is also performed upon exiting the hall, when playing with a colleague, the organizing committee of the tournament, before and after the match (Shia) or during training and exercise (Randori), and it must be the legitimate salutation.
ar: تأدية التحية عند دخول البساط و الخروج منه كذلك تؤدى التحية عند الخروج من الصالة وعند اللعب مع الزميل و للجنة المنظمة للبطولة وقبل و بعد المباراة (شياى) او اثناء التدريب و التمرين (راندورى) ويجب أن تكون التحية المشروعة.

# screen3dialog5
source: Sitting on the rug during training and competitions should be in a standard form of Japanese customs (sitting kneeling - sitting square.)
ar: يجب ان يكون الجلوس على البساط اثناء التدريب و المسابقات فى شكل موحد للعادات اليابانية (جلوس الجثو- الجلوس تربيع.(

# screen3dialog6
source: The player must respect his coaches, obey their instructions and instructions, be loyal to them, and not object to the referee's decisions.
ar: يجب على اللاعب احترام مدربيه و يطيع تعليماتهم وارشاداتهم و يكن لهم الولاء ولايعترض على قرارات الحكم.

# screen3dialog7
source: Attention should be paid to personal hygiene, including attention to the cleanliness of the suit, and the nails of the hands and feet should be short.
ar: يجب الاهتمام بالنظافة الشخصية و منها الاهتمام بنظافة البدلة وان تكون اظافر اليديين و القدمين قصيرة.

# screen3dialog8
source: Not wearing any solid object such as rings, watches or wristbands that expose the competitor to danger.
ar: عدم ارتداء اى جسم صلب كالخواتم والساعات واساور المعصم التى تعرض المنافس للخطر.

# screen3dialog9
source: Ensuring the safety of the player by conducting periodic medical examinations to ensure that he is free of infectious diseases.
ar: التاكد من سلامة اللاعب وذلك بإجراءالكشف الطبى الدورى للتأكد من خلوه من الامراض المعدية.

# screen3dialog10
source: The rug prepared for training must be constantly clean.
ar: يجب ان يكون البساط المعد للتدريب نظيفا بإستمرار.

# screen3dialog11
source: The player should not be reckless in using the arts of the game during training or competition.
ar: على اللاعب عدم التهور فى استعمال فنون اللعبةاثناءالتدريب او المنافسة.

# screen2text1
source: The basic positions in judo:-
ar: الاوضاع الاساسية في رياضة الجودو:-

# screen2text2
source: The basic conditions are the backbone of any sports performance that can be achieved in the vicinity of the game, and thus the individual’s training level can be advanced. Without these conditions, we do not wait for any high level to be achieved to reach the championship level, and the basic conditions are considered the basic pillar on which the player depends during his training life .
ar: تعتبر الاوضاع الاساسية هى العمود الفقرى لاى اداء رياضى يمكن ان يتحقق فى محيط اللعبة و بذلك يمكن التقدم بالمستوى التدريبى للفرد فبدون هذه الآوضاع لا ننتظر أن يتحقق أى مستوى عالى لنصل إلى مستوى البطولة و تعتبر الآوضاع الأساسية الركيزة الأساسية التى يعتمد عليها اللاعب خلال عمره التدريبي .

# screen2text3
source: The basic positions in judo are:-
ar: والاوضاع الاساسية في رياضة الجودو هي :-

# screen2text4_1
source: Greetings
ar: التحية

# screen2text4_2
source: Move on the rug
ar: التحرك على البساط

# screen2text4_3
source: Standing on the rug
ar: الوقوف على البساط

# screen2text4_4
source: Hold the suit
ar: مسك البدلة

# screen2text4_5
source: Unbalance the competitor
ar: اخلال توازن المنافس

# screen2text4_6
source: Falling on the rug
ar: السقوط على البساط

# screen2text5
source: First: Greeting:
ar: اولا:التحية:-

# screen2text6
source: Greetings from above (Touch Ray)
ar: التحية من أعلي (تاتش ريه)

# screen2text6_1
source: Falling on the rug
ar: السقوط على البساط

# screen2text6_2
source: The contestants stand face to face
ar: يقف المتسابقين وجها لوجه

# screen2text6_3
source: The feet are together and the insteps are apart
ar: القدمين مضمومتين والمشطين متباعدين

# screen2text6_4
source: The salute is done by leaning the torso forward slightly while moving the hands from the side
ar: تكون التحية بميل الجذع للأمام قليلا مع تحريك اليدين من الجانب

# screen2text6_5
source: Look at the competitor
ar: النظر يكون على المنافس

# screen2text6_6
source: Return to the standing position again
ar: العودة لوضع الوقوف مرة أخرى

# screen2text7
source: Greetings from below, Cesare
ar: التحية من أسفل (سيزارية)

# screen2text7_1
source: From standing, place the left knee on the ground
ar: من الوقوف ضع الركبة اليسرى على الارض

# screen2text7_2
source: Place the right knee next to the left
ar: ضع الركبة اليمين بجانب اليسرى

# screen2text7_3
source: Place the instep of the left foot on the right
ar: ضع مشط القدم اليسرى على اليمين

# screen2text7_4
source: Sitting on the legs
ar: الجلوس بالمقعدة على القدمين

# screen2text7_5
source: The salute is by leaning the torso forward, placing the hands on the mat and looking at the other competitor
ar: تكون التحية بميل الجذع للأمام مع وضع اليدين على البساط والنظر على المنافس الاخر

# screen2text7_6
source: Return to the siza position after saluting
ar: الرجوع لوضع السيزا بعد أداء التحية

# screen2text7_7
source: Return to crouching position
ar: الرجوع لوضع الجثو

# screen2text7_8
source: Unscrew the insteps
ar: فك امشاط القدمين

# screen2text7_9
source: The player stands on the right foot first, then the left foot to reach a standing position
ar: يقف اللاعب على القدم اليمين اولا ثم القدم اليسرى للوصول لوضع الوقوف

# screen2text8
source: Second: Pauses:-
ar: ثانياً:الوقفات:-

# screen2text9
source: Poses are considered one of the important basics in judo because standing correctly on the mat helps the player attack and defend in an easy way. There are two types of stances: -
ar: تعتبر الوقفات من الاساسيات الهامة في رياضة الجودو لان الوقوف الصحيح علي البساط يساعد اللاعب علي الهجوم والدفاع بطريقة سهلة وهناك نوعان من الوقفات هما :-

# screen2text10
source: Attack stance (shizen hon tai):-
ar: الوقفة الهجومية ( شيزن هون تاي):-

# screen2text11
source: We do it so that the feet are spaced as wide as the pelvis, and the body is in one straight line, looking forward. In the case of the right foot in front, it is called a right attack stance (Meji Shizen Hon Tai), and when the left foot is in front, it is called a left attack stance (Hidari Shizen Hon Tai), as follows:-
ar: ونقوم بها بحيث تكون القدمين متباعدين باتساع الحوض ويكون الجسم علي استقامة واحدة والنظر للامام وفي حالة وجود القدم اليمني اماماً تسمي وقفة هجومية يمين ( ميجي شيزن هون تاي) وعند وجود القدم اليسري اماماً تسمي وقفة هجومية يسار (هيداري شيزن هون تاي) كما بالشكل التالي:-

# screen2text12
source: Defensive stance (Jeju Hon Tae):-
ar: الوقفة الدفاعية ( جيجو هون تاي):-

# screen2text13
source: We do it so that the feet are spaced as wide as the pelvis, and the body is in one straight line, looking forward. In the case of the right foot in front, it is called a right attack stance (Meji Shizen Hon Tai), and when the left foot is in front, it is called a left attack stance (Hidari Shizen Hon Tai), as follows:-
ar: ونقوم بها بحيث تكون القدمين متباعدين باتساع الحوض ويكون الجسم علي استقامة واحدة والنظر للامام وفي حالة وجود القدم اليمني اماماً تسمي وقفة هجومية يمين ( ميجي شيزن هون تاي) وعند وجود القدم اليسري اماماً تسمي وقفة هجومية يسار (هيداري شيزن هون تاي) كما بالشكل التالي:-

# screen2text14
source: Fourth: Holding the suit:-
ar: رابعاً:مسك البدلة:-

# screen2text15
source: There are several ways to hold the suit:-
ar: هناك عدة طرق لمسك البدلة وهي:-

# screen2text16
source: The first method: Hold the jacket collar from above with your right hand below the chin and hold the sleeve of the suit with your left hand at the elbow (in the case of a right-handed attack stance)
ar: الطريقة الاولى: مسك ياقة الجاكت من أعلى باليد اليمين أسفل الذقن ومسك كم البدلة باليد اليسرى من عند الكوع (في حالة الوقفة الهجومية اليمين)

# screen2text17
source: The second method: Reversing the previous one (in the case of an offensive stance to the north)
ar: الطريقة الثانية: عكس السابقة (في حالة الوقفة الهجومية شمال)

# screen2text18
source: The third method: Hold the suit collar from behind the competitor's neck with the left hand. Hold the sleeve of the suit with the right hand at the elbow joint (in the case of a left attack stance).
ar: الطريقة الثالثة: مسك ياقة البدلة من خلف رقبة المنافس باليد اليسرى. ومسك كم البدلة باليد اليمني من عند مفصل الكوع (في حالة الوقفة الهجومية شمال)

# screen2text19
source: The fourth method: Reverse the previous one in the case of a right-handed offensive stance
ar: الطريقة الرابعة: عكس السابقة في حالة الوقفة الهجومية يمين

# screen2text20
source: Fifth method: The player holds the suit by the collar with both hands, one on the left side and the other on the right side.
ar: الطريقة الخامسة: يمسك اللاعب البدلة من الياقة بكلتا اليدين واحدة في الناحية اليسرى واخرى في الناحية اليمنى

# screen2text21
source: Method 6: The player grabs the collar of the jacket and the sleeve from one side, and in this case he must use an attack before five seconds have passed, otherwise he will be warned.
ar: الطريقة السادسة: يمسك اللاعب ياقة الجاكيت والكم من جانب واحد وفي هذه الحالة يجب ان يستخدم هجوم قبل مرور خمس ثواني والا تعرض للإنذار

# screen2text22
source: There are some tactical aspects that the coach must take into account when teaching the players to hold the suit:-
ar: وهناك بعض الجوانب التكتيكية التى يجب أن يراعيها المدرب عند تعليم اللاعبين مسكة البدلة:-

# screen2text23
source: 1. The grip should be strong and tight, and have the ability to control and control the opponent's movement forward and backward, up and to the sides.
ar: 1.أن تكون المسكة قوية و محكمة و لها القدرة فى السيطرة و التحكم فى حركة الخصم للامام و الخلف الى أعلى و الى الجانبين.

# screen2text24
source: 2. The grab is considered a very sensitive means of communication that senses any movement the opponent claims to carry out or any attempt made by the opponent to change his direction.
ar: 2.تعتبر المسكة وسيلة إتصال حساسة جدا تشعر بأى حركة يزعم الخصم تنفيذها أو أى محاولة يقوم بها الخصم لتغيير اتجاهه.

# screen2text26
source: 3. The coach must direct the player to the wrong habits when holding the suit so that they do not harm themselves when falling to the ground or hijacking the movement, and explain to them how to get rid of it.
ar: 3.يجب على المدرب أن يوجه اللاعب الى العادات الخاطئة عند مسكة البدلة حتى لايضرون انفسهم عند السقوط على الارض أو خطف الحركة و يوضح لهم كيفية التخلص منها.

# screen2text25
source: 4. The coach must take care that there is space between the grip and the player’s body when performing the movement so that this does not cause a loss of a large part of the player’s strength and consequently affect the performance.
ar: 4.يجب على المدرب أن يراعى أن يكون هناك فراغ بين المسكة و جسم اللاعب عند أداء الحركة حتى لايتسبب ذلك فى فقدان جزء كبير من قوة اللاعب و تؤثر بالتالى على الاداء

# screen2text27
source: 5. The coach should consider changing the positions of the arms in holding the suit, as there are other ways of holding, for example: holding the jacket with the right hand from the sleeve of the left jacket instead of the collar in front of the chest, or holding the same arm from the collar completely behind the neck, or holding the jacket with the two hands from the bottom of the armpits.
ar: 5.أن يراعى المدرب تغيير أوضاع الذراعيين فى مسكة البدلة حيث هناك طرق أخرى للمسك مثال ذلك:المسكة باليد اليمنى من كم الجاكت الايسر بدلآمن الياقة أمام الصدر أو المسك بنفس الذراع من الياقة خلف الرقبة تماما أو مسك السترة باليديين من أسفل الابطين.

# screen2text28
source: 6. Each movement has its own grip, which differs from one movement to another and from one tactic to another. It also differs according to the height and weight of the player facing him. A tall player differs from a short player, and so on.
ar: 6.لكل حركة مسكة خاصة بها تختلف من حركة الى أخرى ومن تكتيك لاخر كما أنها تختلف حسب طول ووزن اللاعب الذى يواجهه فاللاعب الطويل يختلف عن اللاعب القصير و هكذا.

# screen2text29
source: 7. The coach must train the player on holds that do not require a long time so that he can execute the movement as quickly as possible and the referee does not have to issue a warning to him. Example: Holds that allow the player only 5 seconds, such as grabbing the opponent’s jacket and sleeve in the same direction.
ar: 7.يجب على المدرب تدريب اللاعب على مسكات التى لاتحتاج الى وقت طويل حتى يمكنة تنفيذ الحركة فى أسرع وقت ولا يضطر الحكم الى توجية انذار اليةمثال ذلك: المسكات التى تتيح للاعب فرصة 5ثوانى فقط مثل مسك البدلة للخصم من السترة و الكم فى نفس الجهه.

# screen2text30
source: 8. It must be noted that the grip of the suit is different in the defensive position than in the offensive position than in the normal position of play, and this varies depending on the defensive and offensive variables while playing with the opponent.
ar: 8.يجب ملاحظة أن تختلف مسكة البدلة فى الوضع الدفاعى عنة فى الوضع الهجومى عنه فى الوضع الطبيعى للعب وهذه تختلف تبعا للمتغيرات الدفاعية و الهجومية أثناء اللعب مع الخصم.

# screen2text31
source: Fifth: Ways and trends of imbalance:-
ar: خامساً:طرق واتجاهات اخلال التوازن:-

# screen2text32
source: There are several trends in imbalance, which are:
ar: وهناك عدة اتجاهات لاخلال التوازن وهي:-

# screen2text33_1
source: Unbalancing the opponent forward.
ar: إخلال توازن المنافس للأمام

# screen2text33_2
source: Throwing the opponent off balance backwards
ar: إخلال توازن المنافس للخلف.

# screen2text33_3
source: Disrupting the opponent's balance to the right side.
ar: اخلال توازن المنافس للجانب الايمن.

# screen2text33_4
source: Disruption of the competitor's balance to the left side.
ar: إخلال توازن المنافس للجانب الايسر.
