Repository: YoussefM50/judo_app-main
Catalog: lib/l10n/intl_*.arb
Languages: ar

# screen2text33_5
source: Unbalancing the opponent forward and to the right side.
ar: إخلال توازن المنافس للأمام وللجانب الايمن.

# screen2text33_6
source: Disrupting the competitor's balance forward and to the left side.
ar: إخلال توازن المنافس للأمام وللجانب الايسر.

# screen2text33_7
source: Unbalancing the opponent backwards and to the left side.
ar: إخلال توازن المنافس للخلف وللجانب الايسر.

# screen2text33_8
source: Honoring the opponent's balance behind and to the right side.
ar: إجلال توازن المنافس للخلف وللجانب الايمن.

# screen2text35
source: Sixth: Mistakes (Okimi):-
ar: سادساً:السقطات(اوكيمي):-

# screen2text36
source: These falls are divided into:
ar: وتنقسم تلك السقطات إلي:-

# screen2text37_1
source: back fall
ar: السقطة الخلفية

# screen2text37_2
source: Lateral fall (right and left).
ar: السقطة الجانبية( يمين و شمال ).

# screen2text37_3
source: Frontal fall.
ar: السقطة الامامية.

# screen2text37_4
source: Circular frontal drop.
ar: السقطة الامامية الدائرية.
