Repository: YoussefM50/judo_app-main
Catalog: lib/l10n/intl_*.arb
Languages: ar

# hometitle1
source: History of Judo
ar: تاريخ رياضة الجودو

# hometitle2
source: Basic positions in judo
ar: الاوضاع الاساسية في رياضية الجودو

# hometitle3
source: Etiquette and traditions of judo
ar: اداب وتقاليد رياضة الجودو

# hometitle4
source: How to wear a suit for beginners
ar: طريقة ارتداء البدلة للمبتدئين

# hometitle5
source: The importance of warming up for judo players
ar: اهمية الاحماء للاعبي الجودو

# hometitle6
source: The most important playing skills for judo players
ar: اهم مهارات اللعب من اعلي للاعبي الجودو

# hometitle7
source: Judo sports terminology
ar: مصطلحات رياضية الجودو

# title
source: Hello...
ar: اهلا وسهلا...

# doctors
source: Dr/ Anwar Khatab
ar: د/انور خطاب

# coaches
source: coach : Ahmed Mostafa Mostafa coach : Ahmed Nabel Mohammed
ar: كابتن / احمد مصطفى مصطفى كابتن / احمد نبيل محمد

# programmers
source: Programmed by Eng/ Hossam Ali, Youssef Medhat, Khaled Ahmed and Abanoub Emad
ar: تمت البرمجة بواسطة : حسام علي و يوسف مدحت و خالد احمد و ابانوب عماد

# appbartitle
source: Judo
ar: جودو

# splashscreendialog1
source: Designed by
ar: التصميم بواسطة :

# screen4title
source: How to wear a judo suit:
ar: طريقة ارتداء بدلة الجودو:-

# screen4descreption1
source: Before starting training or competition, we must wear the suit well. We will show how to wear the suit. We must wear the pants first, then the jacket, then the belt, as follows:-
ar: يجب علينا قبل البدء في التدريب او المنافسة ارتداء البدلة جيداً وسوف نعرض طريقة ارتداء البدلة ويجب ارتداء البنطلون اولاً ثم السترة ثم الحزام كما بالطريقة التالية:-

# screen4subtitle1
source: How to wear judo pants 'customer':-
ar: طريقة إرتداء بنطلون الجودو 'زوبون':-

# screen4topic1
source: • The two pants' ties are pulled from the back as shown in the figure.
ar: • يتم سحب ربطي البنطلون من الخلف كما بالشكل.

# screen4topic2
source: • The drawstring of the trousers is tightened and the drawstring is inserted into the buttonhole as shown in the figure:-
ar: • يتم سحب ربطي البنطلون من الخلف كما بالشكل.

# screen4topic3
source: • The two laces are tied together in the front as shown in the figure:-
ar: • يتم ربط الرباطين من الامام مع بعضيهما كما بالشكل:-

# screen4subtitle2
source: How to wear the 'Bawaji' jacket:-
ar: طريقة إرتداء الجاكت 'يواجي':-

# screen4topic4
source: • The right end of the jacket is placed on it, then the left end of the jacket is placed on it so that the mark of making the suit appears from the bottom of the jacket, as shown in the figure: -
ar: • يتم وضع الطرف الايمن من الجاكت ثم يوضع علية الطرف الايسر من الجاكت بحيث تظهر علامة صنع البدلة من إسفل الجاكت كما بالشكل:-

# screen4subtitle3
source: How to tie an obi belt:
ar: طريقة ربط الحزام 'اوبي':-

# screen4topic5
source: • The middle of the belt is placed on the abdomen, approximately at the navel, from the front, as shown in the figure:-
ar: • يتم وضع منتصف الحزام عند البطن عند السرة تقريباً من الامام كما بالشكل :-

# screen4topic6
source: • Wrap the belt around the middle from the back and then to the front as follows:-
ar: • يلف الحزام حول الوسط من الخلف ثم إلي الامام كما بالشكل التالي :-

# screen4topic7
source: • Then we place the left end of the belt on the right end and insert it from the bottom of the two turns of the belt from the front, so that the left end becomes higher and the right end becomes lower, as in the figure: -
ar: • ثم نضع الطرف الشمال للحزام علي الطرف اليمين وندخلة من اسفل اللفتين للحزام من الامام حيث يصبح الطرف الشمال أعلي والطرف اليمين اسفل كما بالشكل :-

# screen4topic8
source: • Then we place the left end over the right end of the belt and twist it, then insert it between the right end and tighten it so that it becomes as in the figure:-
ar: • ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-

# screen4subtitle4
source: How to apply a judo suit:-
ar: طريقة تطبيق بدلة الجودو:-

# screen4topic9
source: The suit is applied as follows:-
ar: يتم تطبيق البدلة كما بالشكل التالي :-

# screen4topic10
source: Then we wrap the suit by rotating as follows:-
ar: ثم نقوم بلف البدلة عن طريق الدوران كما بالشكل التالي:-

# screen4topic11
source: • Then we place the left end over the right end of the belt and wrap it, then insert it between the right end and tighten it so that it becomes as in the figure: - Then we tie the belt as follows: -
ar: • ثم نضع الطرف الشمال فوق الطرف الايمن للحزام ونلفة ثم ندخلة بين الطرف اليمين ونشدة ليصبح كما بالشكل:-ثم نقوم بربط الحزام كما بالشكل التالي:-

# screen4subtitle5
source: How to apply a judo suit:-
ar: طريقة تطبيق بدلة الجودو:-

# screen4topic12
source: The player is not allowed to wear any clothes under the judo jacket, and only girls wear a white T-shirt under the yogi.
ar: لا يسمح للاعب بإرتداء إي ملابس إسفل جات الجودو'يواجي' و البنات فقط يرتدون تي شرت ابيض إسفل اليواجي.

# screen6title
source: Some throwing skills from above in judo:-
ar: بعض مهارات الرمي من أعلي في رياضة الجودو:-

# screen6type1
source: di ashi bray
ar: دي اشي براي

# screen6type2
source: Haiza Guruma
ar: هيزا جوروما

# screen6type3
source: Sasai Tsurikumi Ashi
ar: ساساي تسوريكومي آشي

# screen6type4
source: Ok Joshi
ar: اوكي جوشي

# screen6type5
source: Usutu jari
ar: اوسوتو جاري

# screen6type6
source: Oh Joshy
ar: او جوشي

# screen6type7
source: aw atshi jari
ar: او اتشي جاري

# screen6type8
source: Ippon Seo Nagi
ar: ايبون سيو ناجي

# screen6type9
source: Kosuto jari
ar: كوسوتو جاري

# screen6type10
source: Ko-achi-jari
ar: كو اتشي جاري

# screen6type11
source: Kochi Guruma
ar: كوتشي جوروما

# screen6type12
source: Tsuri kumi joshi
ar: تسوري كومي جوشي

# screen6type13
source: Okoriya ashy harae
ar: اوكورية آشي هراي

# screen6type14
source: Tai Otoshi
ar: تاي اوتوشي

# screen6type15
source: Hrai Joshi
ar: هراي جوشي

# screen6type16
source: Uchi mata
ar: اوتشي ماتا

# screen6type17
source: Kusuto Jackie
ar: كوسوتو جاكي

# screen6type18
source: Tsuri Joshi
ar: تسوري جوشي

# screen6type19
source: Yoko Otoshi
ar: يوكو اوتوشي

# screen6type20
source: Ashi Guruma
ar: آشي جوروما

# screen6type21
source: Hani Joshi
ar: هاني جوشي

# screen6type22
source: Hirai Tsurikumi Ashi
ar: هراي تسوريكومي آشي

# screen6type23
source: Tommy Nagy
ar: تومي ناجي

# screen6type24
source: Kata Guruma
ar: كاتا جوروما

# screen6type25
source: Sumi Gachi
ar: سومي جاتشي

# screen6type26
source: Tani Otoshi
ar: تاني أوتوشي

# screen6type27
source: Hani Maki Kumi
ar: هاني ماكي كومي

# screen6type28
source: Sukui Nagi
ar: سوكوي ناجي

# screen6type29
source: Tsuri Joshi
ar: تسوري جوشي

# screen6type30
source: Oh Groma
ar: أو جروما

# screen6type31
source: Soto Makikomi
ar: سوتو ماكيكومي

# screen6type32
source: Okay Otoshi
ar: اوكي اوتوشي

# screen6type33
source: Osuter Guruma
ar: أوسوتر جوروما

# screen6type34
source: Oki waza
ar: أوكي وازا

# screen6type35
source: Yo Wakari
ar: يكو وكاري

# screen6type36
source: Yoko Guruma
ar: يوكو جوروما

# screen6type37
source: Oshiro Joshi
ar: أوشيرو جوشي

# screen6type38
source: Ura Neji
ar: اورا ناجي

# screen6type39
source: Sumi Otoshi
ar: سومي اوتوشي

# screen6type40
source: Yoko Jackie
ar: يوكو جاكي

# screen6type41
source: Marute Sionagi
ar: مروتيه سيوناجي

# screen6type42
source: Marwateh gari
ar: مروتيه جاري

# screen6type43
source: yamarashi
ar: ياماراشي

# screen6type44
source: Usto Otoshi
ar: اوستو اوتوشي

# screen6type45
source: tasamaba jishi
ar: تسمبا جيشي

# screen6type46
source: Hani Joshi Jayshi
ar: هاني جوشي جايشي

# screen7title
source: Some terms related to judo:
ar: بعض المطلحات الخاصة برياضة الجودو :

# screen7num
source: M
ar: م

# screen7arabicterm1
source: judo player
ar: لاعب جودو

# screen7arabicterm2
source: Jacket
ar: الجاكت-السترة

# screen7arabicterm3
source: Belt
ar: الحزام

# screen7arabicterm4
source: pants
ar: البنطلون

# screen7arabicterm5
source: Judo suit
ar: بدلة الجودو

# screen7arabicterm6
source: Judo hall
ar: صالة الجودو

# screen7arabicterm7
source: rug
ar: البساط

# screen7arabicterm8
source: hand
ar: ايد

# screen7arabicterm9
source: middle/seat
ar: وسط/ مقعدة

# screen7arabicterm10
source: foot
ar: قدم

# screen7arabicterm11
source: Teacher/Coach
ar: معلم/ مدرب

# screen7arabicterm12
source: Salute from standing
ar: التحية من الوقوف

# screen7arabicterm13
source: Greetings from below
ar: التحية من اسفل

# screen7arabicterm14
source: Natural stance
ar: الوقفة الطبيعية

# screen7arabicterm15
source: Natural right stance
ar: الوقفة الطبيعية يمين

# screen7arabicterm16
source: Natural Pause North
ar: الوقفة الطبيعية شمال

# screen7arabicterm17
source: defensive stance
ar: الوقفة الدفاعية

# screen7arabicterm18
source: Defensive stance right
ar: الوقفة الدفاعية يمين

# screen7arabicterm19
source: Defensive position north
ar: الوقفة الدفاعية شمال

# screen7arabicterm20
source: suit grip
ar: مسكة البدلة

# screen7arabicterm21
source: Move on the mat
ar: التحرك علي البساط

# screen7arabicterm22
source: imbalance
ar: أخلال التوازن

# screen7arabicterm23
source: Hiccups
ar: السقطات

# screen7arabicterm24
source: side fall
ar: السقطة الجانبية

# screen7arabicterm25
source: Back drop
ar: السقطة الخلفية

# screen7arabicterm26
source: Circular frontal fall
ar: السقطة الامامية الدائرية

# screen7arabicterm27
source: Front fall
ar: السقطة الامامية

# screen7arabicterm28
source: North side fall
ar: السقطة الجانبية شمال

# screen7arabicterm29
source: Side fall to the right
ar: السقطة الجانبية يمين

# screen7arabicterm30
source: referee
ar: حكم

# screen7japaneseterm1
source: Judoka
ar: جودوكا

# screen7japaneseterm2
source: yuaji
ar: يواجي

# screen7japaneseterm3
source: Obi
ar: أوبي

# screen7japaneseterm4
source: zbun
ar: زبون

# screen7japaneseterm5
source: Judogi
ar: جودوجي

# screen7japaneseterm6
source: Dojo
ar: دوجو

# screen7japaneseterm7
source: Tatami
ar: تاتامي

# screen7japaneseterm8
source: Ti
ar: تي

# screen7japaneseterm9
source: Joshi
ar: جوشي

# screen7japaneseterm10
source: ashy
ar: اشي

# screen7japaneseterm11
source: Sensai
ar: سنساي

# screen7japaneseterm12
source: Rayya
ar: رية

# screen7japaneseterm13
source: The Rayya
ar: زا رية

# screen7japaneseterm14
source: Shizen Tai
ar: شيزن تاي

# screen7japaneseterm15
source: Meiji Shizen Tai
ar: ميجي شيزن تاي

# screen7japaneseterm16
source: Hidari Shizen Tai
ar: هيداري شيزن تاي

# screen7japaneseterm17
source: Jigutai
ar: جيجوتاي

# screen7japaneseterm18
source: Meiji Jigutai
ar: ميجي جيجوتاي

# screen7japaneseterm19
source: Hydari Jigutai
ar: هيداري جيجوتاي

# screen7japaneseterm20
source: Komi kata
ar: كومي كاتا

# screen7japaneseterm21
source: tay sbaki
ar: تاي سباكي

# screen7japaneseterm22
source: Kuzushi
ar: كوزوشي

# screen7japaneseterm23
source: Okimi
ar: اوكيمي

# screen7japaneseterm24
source: Yoko Okimi
ar: يوكو اوكيمي

# screen7japaneseterm25
source: Oshiroa Okimi
ar: اوشيروا اوكيمي

# screen7japaneseterm26
source: Mai Mwari Okemi
ar: ماي مواري أوكيمي

# screen7japaneseterm27
source: Mai Okimi
ar: ماي اوكيمي

# screen7japaneseterm28
source: Hidari Yuko Okimi
ar: هيداري يوكو اوكيمي

# screen7japaneseterm29
source: Meiji Yuko Okimi
ar: ميجي يوكو اوكيمي

# screen7japaneseterm30
source: Shinban
ar: شينبان

# screen7subtitle1
source: Term in English
ar: المصطلح باللغة العربية

# screen7subtitle2
source: Term in Japanese
ar: المصطلح باللغة اليابانية

# screen7subtitle3
source: Illustration of the term
ar: صورة توضيحية للمصطلح

# screen1description
source: Judo Sport History
ar: تاريخ رياضة الجودو

# screen1dialog1
source: Ancient history records for us the first start of this type of fight, which is the famous battle that took place between (Nomino Sokuna) and the warrior (Taima Nokohama) in Japan during the days of Emperor (Sunin) in 23 BC.
ar: التاريخ القديم يسجل لنا اول بداية لهذا النوع من النزال وهى المعركة الشهيرة التي تمت بين (نومينو سوكونة)والمحارب (تايما نوكوهاما) فى اليابان أيام الامبراطور (سونيين) عام 23 ق.م.

# screen1dialog2
source: The two men met and fought each other, and each had their own style of fighting, consisting of wrestling skills in their primitive form, and the arts of striking with hand and foot. The battle ended with the killing of the warrior (Taima Nokohama) as a result of a strong blow to the foot and breaking his ribs, and that was the fight in Japan.
ar: تقابلا الرجلان وتقاتلا كلا منهما وكان لكل منهما اسلوبة الخاص فى القتال والمكون من مهارات المصارعة فى شكلها البدائى وفنون الضرب باليد والقدم وانتهت المعركة بمقتل المحارب (تايما نوكوهاما) نتيجة ضربة ضربة قوية بالقدم وكسر ضلوعه وكان ذلك القتال فى اليابان .

# screen1dialog3
source: After that, the ruling Japanese Empire took care of this fight. In the year 1375 AD, the Japanese Emperor (Shomo) devised a day for the celebration of the warrior knights, and it is known as (Sandotsu Day), and this celebration included (shooting arrows - archery from horses - Japanese wrestling).
ar: بعد ذلك اهتمت الإمبراطورية اليابانية الحاكمة بهذا القتال . وفى عام 1375م ابتكر الامبراطور الياباني (شومو) يوم لاحتفال الفرسان المحاربين وهو يعرف باسم (يوم ساندوستسو)وكان هذا الاحتفال يشمل (الرمي بالسهام – الرمي بالسهام من على الخيل – المصارعة اليابانية ) .

# screen1dialog4
source: After 300 years of stopping that day, this celebration was resumed again in the same style, with the aim of showing the royal families the ingenuity of their knights.
ar: وبعد 300عام من التوقف عن ذلك اليوم استؤنف هذا الاحتفال مرة أخرى وبنفس الأسلوب والهدف من ذلك إظهار العائلات الملكية براعة فرسانهم .

# screen1dialog5
source: In that period, one of the samurai knights laid the first stone in the sport of judo, which is the method of (Kumi Uchi), which is the method of fighting hand to hand, and this method was known after that as (Jujitsu).
ar: وفى تلك الفترة قام احد الفرسان الساموراى بوضع اول حجر فى رياضة الجودو وهى طريقة (كومى اوتشى) وهو أسلوب القتال يد بيد وعرفت هذه الطريقة بعد ذلك باسم (الجوجيتسو).

# screen1dialog6
source: And researchers in Japanese history said that it is possible that the first school arose on the method of (Kumi Uchi) in fighting was in the late sixteenth century and the beginning of the seventeenth century, and that the origin of this art was vague, but the official history of Japan, which was written by the emperor in the year 720 AD, referred to a cycle ( Lekar-Korea-Struggle of Power) in which I practiced this sport.
ar: والباحثين فى التاريخ الياباني قالوا إن من المحتمل إن اول مدرسة نشأت على طريقة (كومى اوتشى) فى القتال كانت فى أواخر القرن السادس عشر وبداية القرن السابع عشر وان أصل هذا الفن كان مبهم ولاكن التاريخ الرسمي لليابان والذي كتب الامبراطور فى عام 720م قد أشار لدورة (ليكار-كوريا- صراع القوة) التي مارست فيها هذه الرياضة .

# screen1subtitle1
source: jujitsu
ar: الجوجيتسو

# screen1dialog7
source: Jujitsu is the art of combat during war, and it was without rules. Its goal was to preserve life by killing the opponent, as defeat meant death and victory meant life. It was used by ancient Japanese warriors (samurai), the nobility, and rulers. It originated from Tibet, then spread to China and from there to Japan. The credit for bringing it to Japan goes to a student named Akamatsu Oshito from Nishijin, Nagasaki, who was studying in China. He noticed that when a strong wind blew on a large willow tree, it would break under the force of the wind, while the branches of the soft and slender cherry tree would bend and then return to their original position after the wind subsided. From here, the spiritual philosophy of this art was built, based on the saying, (Do not be rigid,) meaning that having fixed muscular strength would lead to breaking, as there is always someone stronger when compared. (Do not be weak) meaning that having a weak body without physical fitness would create difficulties. Instead, be strong by acquiring elements of flexibility, strength, speed, endurance, and agility, combined with fundamental skills to give you high mobility. Jujitsu has risks and moves that can lead to death in some cases.
ar: فن الجوجيتسو هو فن القتال اثناء الحرب وكان بدون قواعد والهدف منة المحافظة على الحياة بقتل المنافس الأخر حيث أن الهزيمة تعنى الموت والانتصار يعنى الحياة وكان يستخدمه المحاربين القدماء اليابانيين (الساموراى) وطبقة النبلاء والحكام وهو مأخوذ من بلاد التبت ثم انتقل الى الصين ومنها الى اليابان ويرجع الفضل فى نقلها لليابان الى طالب يدعى (اكباما اوشيتو)من نجازاكى والذي كان يدرس العلوم في الصين وقد لاحظ عند هبوب الرياح على شجرة الصفصاف الكبيرة فتنكسر تحت قوة الرياح بينما فروع شجرة الكرز الرفيعة اللينة تنثني ثم تعود لوضعها الأول بعد انتهاء شدة الرياح . ومن هنا بنيت الفلسفة الروحية لذلك الفن على المثال القائل (لا تكن صلبا )اى ذو قوة عضلية ثابتة فتنكسر لان القوة العضلية ثابتة نسبيا فهناك الأقوى إذا ما قورنت بأخرى .(ولا تكن لينا) اى ضعيف البدن ليس لديك لياقة بدنية فتعسر . ولاكن كن قويا مع اكتساب عنصر المرونة والقوة والسرعة والتحمل والرشاقة ومرتبطة بالمهارات الأساسية لتعطيك القدرة الحركية العالية وفن الجوجيتسو له مخاطر وحركات تؤدى للموت أحيانا .

# screen1dialog8
source: The art of jujitsu has different schools, among the oldest and most famous
ar: ولفن الجوجيتسو مدارس مختلفة ومن أقدمها وأشهرها

# screen1dialog9
source: _ School (Takno Uchi) and its founder (Takno Uchi Hisa Mori) in 1532 A.D. He taught his students the art of (Kogyosoku), which is the art of control and reservation. _ School (Kito) and its founder is (Tirada Kan Amun). _ The school (Ki Oshin) and its founder (Anyo Gami Naga Katsu). _ The school (Yushin and Miura) as two schools with a very great reputation in Japan, and two of its teachers won a very great reputation, and they are (Toshuka) and (Asumata Yushin).
ar: _ مدرسة (تاكنو اوتشى )ومؤسسها (تاكنو اوتشى هيسا مورى ) عام 1532م وعلم تلاميذه فن (الكوجيوسوكو) وهو فن السيطرة والحجز. _ مدرسة (كيتو) ومؤسسها هو(تيرادا كان امون). _ مدرسة (كى اوشين )ومؤسسها(انيو جامى ناجا كاتسو). _ مدرسة (يوشين وميورا) كمدرستين ذات شهرة كبيرة جدا فى اليابان ونال اثنين من مدرسيها شهرة كبيرة جدا وهم (توشوكا )و(اسوماتا يوشين) وكان الهدف من ممارستها هو المحافظة على الحياة من التعرض للمخاطر والاعداد البدني وتقوية الجسم .'
