Repository: YoussefM50/judo_app-main
Catalog: lib/l10n/intl_*.arb
Languages: ar

# screen1dialog10
source: It is a combat sport that combines physical fitness, discipline and sound thinking, and it is a traditional Japanese sport. It differs greatly from its counterparts in other combat sports, as it does not depend on kicking, pushing, striking with hands, or any other fighting techniques, as well as it is devoid of weapons and tools that are used in other combat sports. The literary translation of the word Judo in English is high art, but this translation is misleading because it appeals to the comic image of the sport. Des Marwood indicated that Judo is a word consisting of two syllables: _ Ju, which means fine or gentle, and is in English “gentle.” _ Du (D0) means art, and it is in English (art). ) But in fact, the art is an analysis of skills through the opponent's defense in a closed space, and the word Ju symbolizes the principle of not responding violently to violence, and the criticism of the word Ju is derived from Kendo and symbolizes force against force. It is said that the sport of judo is not Japanese, but it has its ancient historical roots. There was a man named (Akiyama Oshito) from Nagasaki Province in Japan studying in China, and there he was impressed by the wrestling of the people of China, and that was in the seventh century BC, then he transferred it to his home, but China transferred it from ancient Egypt, where the ancient pharaohs practiced this type of wrestling since three thousand years BC, and then it was transferred by the Hyksos to Southeast Asia after the end of their raids and defeat by the ancient pharaohs in Egypt, where there are many drawings that resemble a lot of Judo movements now and also tying the belt on the abdomen, on the walls of Bani Hassan temples, and many ancient Pharaonic tombs. Judo is one of the typical Japanese sports with an international character or characteristic, and it contributes, being a problem of culture in itself, to bringing about friendship and peace between countries and peoples of the world in a tremendous way these days, by providing people with an area in which they can achieve fruitful exchange among themselves, and then we find that the game Judo provides help and aid to promote happiness, prosperity and well-being for all human beings, and that is the message of judo, and there is no higher goal than this goal. Many decades ago, the sport of judo was considered a sport in which only the Japanese were distinguished, but with the achievement of the international character of this sport, the performance of judo players from all over the world has clearly improved, and they have shown skill and strength when compared with non-Japanese players to outperform the Japanese judo players until They became Olympic or world champions, and their achievements show very clearly that the sport of judo is no longer a monopoly on Japan, but has become the property of the whole world, and this helps in sparking further spread and development of judo. The emergence of the sport of judo in its current form is due to Jigor Kano, who was born in 1860 AD, and learned literature and philosophy at the University of Tokyo in 1881 AD, and is considered one of the founding members of the Olympic Games in 1896 AD, and Kano took over the Ministry of Education in his country, making judo among the subjects education in schools at that time, then he died in 1938 AD - during his return trip at sea due to a sudden illness, after a meeting of the International Olympic Federation in Cairo, and Kano before his death had made great efforts in all parts of the world in order to spread the sport of judo and increase practitioners at different levels. In 1882, Jigor Kano established an international academy for teaching various judo arts in Tokyo. And Tony, Geoffrey points out that in ancient times in Japan and several centuries ago, power and strength were concentrated in the hands of the strong feudal government at the expense of the weak central government, so each ruler of a region at that time had a group of warriors and samurai fighters, who relied on them to protect the region from attacks. And external problems, so this class of people was training hard and diligently to fight by using hands, and also by using weapons. And there were specialized schools to teach these different martial arts and movements to the samurai class so that there would be those who could deter the people during the outbreak of popular revolutions and riots. Until the mid-19th century, no ordinary person could train in those martial arts; they were exclusively reserved for samurai warriors. However, a new government came into power in 1873, ending this system and relieving the samurai class of their duties, sending them into retirement. This was the main reason for the division of the people into two groups during the disturbances and revolutions. One group suppressed the riots and represented the police while the other group tried to regain their former position in the samurai class and represented the police group. When Jigoro Kano was eighteen years old in 1878, he gathered all the movements that the samurai class used to train in, which were called Jujutsu. He did this in the town of Shinorio under the supervision of two men named Fukuda and Iso, who held high positions in the Military Academy, which was completed in 1895 in Kyoto, Japan. Kano arranged and eliminated the dangerous and deadly movements, analyzed them, and identified the main points of how to teach these movements to the general public in a special school. That school was the Kodokan, which we mentioned earlier was established in 1882 in Tokyo, Japan. The Kodokan is the place where people come from all over the world for education and training, and to know everything new about the sport of Judo, because of the presence of high-level experiences from teachers and trainers who can consolidate and refine these experiences among the arrivals to the Kodokan. The sport of judo had entered Egypt for the first time in 1934 through Japanese experts to train the army and police forces at that time on the combat skills found in this sport in this sport, and in 1952 AD the International Judo Federation (I J F) was formed, in which so far more From a hundred countries, judo was accepted as an Olympic sport in 1964 at the Tokyo Olympic Games.
ar: هي رياضة قتالية تجمع بين اللياقة البدنية والانضباط والتفكير السليم، وهي رياضة تقليدية يابانية. وتختلف بشكل كبير عن مثيلاتها من الرياضات القتالية الأخرى، فهي لا تعتمد على الركل والدفع، والضرب بالأيدي أو على أي من تقنيات القتال الأخرى، كذلك فهي تخلو من الأسلحة والأدوات التي تستعمل في الرياضات القتالية الأخرى. أن الترجمة الأدبية لكلمة جودو Judo باللغة الإنجليزية هي الفن الرفيع لكن هذه الترجمة تكون خادعة لأنها تناشد الصورة الهزلية للرياضة . وقد أشار ديس مارود Des Marwood إلى أن الجودو Judo عبارة عن كلمة تتكون من مقطعين هما : _ جو ( Ju ) وتعني الرفيع أو الرقيق وهي بالإنجليزية “ gentle “. _ دو (D0) وتعني الفن وهي بالإنجليزية .(art) لكن في الواقع أن الفن عبارة عن تحليل للمهارات من خلال دفاع الخصم في مساحة مغلقة ، وكلمة “Ju “ ترمز لمبدأ عدم الرد بعنف على العنف ويكون النقيد لكلمة “ Ju “ واصلها “Kendo” وترمز إلى القوة ضد القوة . ويقال أن رياضة الجودو ليست يابانية ولكن لها جذورها التاريخية القديمة فقد كان هناك رجل أسمه (اكياما أوشيتو ) من مقاطعة نجازاكي في اليابان يدرس في الصين ، وهناك أعجب بمصارعة أهل الصين ، وكان ذلك في القرن السابع قبل الميلاد ، ثم قام بنقلها إلى موطنه ، لكن الصين نقلتها عن مصر القديمة ، حيث كان الفراعنة القدماء يمارسون هذا النوع من المصارعة منذ ثلاث آلاف عام قبل الميلاد ، ثم نقلت عن طريق الهكسوس إلى جنوب شرق أسيا بعد انتهاء غاراتهم وانهزامهم من الفراعنة القدماء في مصر ، حيث توجد العديد من الرسوم التي تشبه الكثير من حركات الجودو الآن وأيضاً ربط الحزام على البطن ، على جدران معابد بني حسن ، والعديد من المقابر الفرعونية القديمة . والجودو أحدى الرياضات اليابانية النموذجية ذات الصفة أو الخاصية الدولية ، وهي تسهم بكونها مشكلة الثقافة بذاتها في احداث الصداقة والسلام بين دول وشعوب العالم بشكل هائل هذه الأيام ، وذلك بما تقدمه للشعوب من مجال يمكنهم أن يحققوا فيه التبادل المثمر فيما بينهم ، ومن ثم نجد ان لعبة الجودو تقدم المساعدة والعون لتعزيز السعادة والرخاء والرفاهية لجميع البشر ، وتلك هي رسالة الجودو ، وليس هناك من هدف أسمى من هذا الهدف . ومنذ عقود عديدة خلت كانت رياضة الجودو تعتبر رياضة لا يتميز فيها إلا اليابانيون فقط ، غير أنه بتحقق الصفة الدولية لتلك الرياضة تحسن اداء لاعبي الجودو من شتى دول العالم تحسناً واضحاً ، وأظهروا مهارة وقوة عند مقارنتهم مع اللاعبين غير اليابانيين من التفوق على لاعبي الجودو اليابانيين حتى اصبحوا أبطالاً أوليمبيين او عالميين وتبين انجازاتهم بوضوح تام أن رياضة الجودو لم تعد حكرا على اليابان ولكنها قد أصبحت ملكاً للعالم بأكملة ، وهذا يساعد في أثارة مزيد من الانتشار، والتطور للجودو . ويرجع ظهور رياضة الجودو بشكلها الحالي إلى جيجور كانو الذي ولد عام 1860 م ، وتعلم الأدب والفلسفة في جامعة طوكيو عام 1881م ، ويعتبر من الأعضاء المؤسسين للألعاب الأوليمبية عام 1896 م ، وقد تولى كانو وزارة التعليم في بلادة ، فجعل الجودو ضمن المواد التعليمية في المدارس في ذلك الوقت ، ثم توفي عام 1938م – أثناء رحلة عودته في البحر بسبب مرض فاجئة ، وذلك بعد اجتماع للإتحاد الدولي الأوليمبي في القاهرة ، وكان كانو قبل وفاته قد قام بمجهودات عظيمة في شتى انحاء العالم من اجل نشر رياضة الجودو وزيادة الممارسين لها على مختلف المستويات . وقد قام جيجور كانو في عام 1882 بأنشاء اكاديمية عالمية لتعليم فنون الجودو المختلفة في طوكيو ، وأسمها الكودوكان ومعناها : الصالة التي يتم فيها التعليم والتدريب على القواعد . ويشير توني ، جيوفري إلى أنه في العصور القديمة في اليابان ومن عدة قرون مضت كانت السلطة والقوة تتركز في يد الحكومة الأقطاعية القوية على حساب الحكومة المركزية الضعيفة ، فكان لكل حاكم أقليم آنذاك مجموعة من المحاربين والمقاتلين الساموراي والذي يعتمد عليهم في حماية الأقليم من الاعتداءات والمشاكل الخارجية ، فكانت تلك الطبقة من الشعب تتدرب بقوة واجتهاد على القتال باستخدام الأيدي ، وأيضاً باستخدام السلاح وتقوم بالتدريب المنتظم على مهارات ركوب الخيل ، والسباحة .. الخ والتي تساعدهم أثناء المعارك والحروب . وكانت هناك مدارس متخصصة لتعليم تلك الفنون والحركات القتالية المختلفة لطبقة الساموراي حتى يكون هناك من يستطيع ردع الشعب اثناء اندلاع الثورات الشعبية وأثارة الشغب . وكان حتى منتصف القرن التاسع عشر لا يستطيع أي فرد من عامة الشعب التدريب على تلك الفنون القتالية فهي كانت حكرا فقط على المقاتلين الساموراي إلى أن جاءت حكومة جديدة عام 1873 م لتنهي هذا النظام واعفاء طبقة الساموراي من أعمالهم واحالتهم للتقاعد ، مما كان هذا هو السبب الرئيسي في انقسام الشعب إلى مجموعتين أثناء الاضطرابات والثورات منهم مجموعة تقوم بقمع أعمال الشغب وهي تمثل البوليس والمجموعة الأخرى تحاول أن تقود إلى وظيفتها السابقة في طبقة الساموري ، وهي مجموعة البوليس وعندما كان جيجور كانو في الثامنة عشر من عمره أي في عام 1878 قام بجمع جميع الحركات التي كان يتدرب عليها طبقة الساموراي ، وهي تلك الحركات التي كانت تسمى بالـ الجوجيتسو ، وذلك في بلدة شينوريو وتحت اشراف رجلان هما هما فيوكيودا ، أيزو وكان لهما مكانه عالية في الجامعة الحربية والتي انتهي تكوينها عام 1895 في مقاطعة كيوتو اليابانية ، فقام كانوا بترتيب تلك الحركات واستبعاد الخطير والقاتل منها ثم قام بتحليلها والتوصل إلى النقاط الرئيسية في كيفية تعليم تلك الحركات لعامة الشعب في مدرسة خاصة وكانت تلك هي مدرسة الكودوكان ، والتي ذكرنا سالفا أنه قام بانشائها عام 1882م في طوكيو باليابان. ويعتبر الكودوكان هي المكان الذي يتوافد إلى الناس من كل أنحاء العالم للتعليم والتدريب ، ومعرفة كل جديد عن رياضة الجودو ، ذلك لوجود الخبرات رفيعة المستوى من معلمين ومدربين يستطيعون ترسيخ تلك الخبرات وصقلها لدى الوافدين إلى الكودوكان . وكانت رياضة الجودو قد دخلت مصر لأول مرة عام 1934 عن طريق الخبراء اليابانيين لتدريب قوات الجيش والبوليس في ذلك الوقت على المهارات القتالية الموجودة في هذه الرياضة في هذه الرياضة ، وفي عام 1952 م تم تكوين الاتحاد الدول للجودو (I J F) والذي يشترك فيه حتى الأن اكثر من مائة دولة ، وتم قبول رياضة الجودو كرياضة أوليمبية في عام 1964 في الدورة الأوليمبية بطوكيو.

# screen1subtitle2
source: The Judo
ar: الجودو

# screen1subtitle3
source: Judo is a sport of various benefits
ar: الجودو رياضة الفوائد المتنوعه

# screen1dialog11
source: Martial games are full of violence and excitement, but each game is distinguished by its own destruction in which it shines and its lights shine through it.
ar: تمتليء الالعاب القتاليه بالعنف والاثارة ولكن تتميز كل لعبه في مدمار خاص بها تتالق فيه وتسطع انوارها من خلاله فالفوائد الجسديه تشمل كل الالعاب القتاليه ولكن قليلا منها التي تتميز في اكثر من مجال هنا تتميز الجودو كرياضه فوائدها كثيرة ومنها

# screen1subtitle4
source: A- physical development
ar: أ-التنمية الجسدية:

# screen1dialog12
source: Each skill in judo has its own meaning and significance. The forms of movements are countless because each part of the body can be used in all directions, i.e. up and down, left and right. This is among a large number of skills. That is why the need arises. Therefore, if a person practices judo, all his muscles and bones become stronger and stronger, and at the same time the strength of his internal organs increases. Judo can easily develop a harmonious body and make it strong. In the art of this sport, and this makes the individual always ready to exert his best capabilities quickly against the tricks that the opponent may resort to. In this way, this sport develops freedom of movement in the body and full vigilance towards any emergency. physical water
ar: إن لكل مهارة في الجودو معناها و مغزاها الخاص بها.و إن أشكال الحركات كثيرة لا تحصى لان كل جزء من الجسم يمكن استخدامه في كافة الاتجاهات أي إلى الأعلى و إلى الأسفل و إلى الجهتين اليسرى و اليمنى. وذلك ضمن عدد كبير من المهارات التي تدعو الحاجة إليها.لذلك إذا مارس الشخص رياضة الجودو فان كافة عضلاته و عظامه تشتد و تقوى كما تزداد بنفس الوقت قوة أجهزته الداخلية فرياضة الجودو يمكنها أن تنمي وبسهولة جسما متناسقا و تجعله قويا. بالإضافة إلى أن المتبارين في الجودو يناضلان باذلين أقصى جهد للتفوق في فن هذه الرياضة و ذلك يجعل الفرد دوما على استعداد لبذل أفضل إمكانياته بسرعة ضد الحيل التي قد يلجا إليها الخصم. و بهذا الشكل فان هذه الرياضة تنمي حرية الحركة في الجسم و اليقظة التامة تجاه كل طارئ.

# screen1subtitle5
source: B- mental development
ar: ب-التنمية العقلية:

# screen1dialog13
source: First: When any individual perseveres in the sport of judo in a reasonable and regular manner, psychological changes occur to him without his knowledge, as his nobility and refinement increase. The immersion of difficulties on his own, that is, to become of a stable psyche. Observing his opponent as well. Therefore, the judo practitioner will gradually develop the strength of the heart, the intensity of the strength, the firmness of determination, composure (self-control), the speed of thought characterized by the health of mental judgment, in addition to being cautious and vigilant in thought.
ar: أولا:عندما يقوم أي فرد بالمواظبة على رياضة الجودو بشكل معقول ومنتظم تحدث لديه تغيرات نفسية دون علمه.حيث يزداد نبله و تهذيبه. و أول ما يجنيه من ثمرات ممارسة الجودو هو الجرأة الأدبية و نعني بذلك الروح العالية التي تدفعه إلى خوض غمار الصعوبات من تلقاء نفسه أي أن يصبح ذو نفسية ثابتة. ثانيا:إن الجودو تحتاج إلى صراع جسدي ينهمك به كامل الجسد و العقل معا ضمن ذلك يتهذب كل ذي قوة و ذلك كي يكون قادرا على دوما على كبح جماح نفسه و مراقبتها و مراقبة خصمه ايضا.لذلك سوف تنمو لدى ممارس رياضة الجودو بشكل تدريجي قوة القلب و شدة البأس و صلابة التصميم رباطة الجأش(السيطرة على النفس) و سرعة الخاطر المتسم بصحة المحاكمة العقلية بالاضافة الى التحلي بالحذر و يقظة الفكر.

# screen1subtitle6
source: C- Self defense
ar: جـ - الدفاع عن النفس:

# screen1dialog14
source: Often in our daily lives we encounter material or mental obstacles and sometimes we are exposed to some dangers. That is why judo exercises provide us with physical and mental education and teach us valuable youth movements that enable us to protect ourselves when necessary.
ar: غالبا ما تصادفنا في حياتنا اليومية عوائق مادية أو عقلية و أحيانا تتعرض إلى بعض المخاطر.لذلك تقدم لنا تمارين الجودو التربية الجسمية والعقلية و تعلمنا الحركات الفتية القيمة التي تمكننا من حماية أنفسنا عند اللزوم.

# screen1subtitle7
source: D - Judo is a recreational activity :
ar: د - الجودو نشاط ترويحي:

# screen1dialog15
source: The cohesion of hands between two people and another is one of the instinctive actions of human beings, so we see that the most innovative art of cohesion between the types of sports is the cohesion that takes place in judo.
ar: إن التماسك بالأيدي بين شخصين و آخر هو من الأعمال الغريزية للبشر لذلك نرى إن أبدع فن للتماسك بين أنواع الرياضة التماسك الذي يجري بالجودو،فإذا مارس انسان رياضة الجودو بشكل نظامي فسيرى إن التماسك فيه ممتع جدا الأمر الذي يدعوه إلى الاستمرار في مماؤسة الجودو طيلة حياته.

# screen1subtitle8
source: E - the optimal use of forces:
ar: هـ - الاستخدام الامثل للقوى:-

# screen1dialog16
source: Be it mechanical, anatomical, physiological or psychological, and the victory over the opponent by reaching the maximum capacity with the least effort to achieve the maximum efficiency of the mind and body.
ar: كانت ميكانيكية او تشريحية او فسيولوجية او النفسية و الانتصار على الخصم ببلوغ اقصى مقدرة بأقل مجهود لتحقيق الكفاءة القصوى للعقل و الجسم.

# screen1subtitle9
source: F- Judo works to achieve the psychological aspects :
ar: و- الجودو يعمل على تحقيق الجوانب النفسية:-

# screen1dialog17
source: Therefore, it is considered one of the best competitive sports because it works on personality formation and increases the individual's self-confidence, the desire to excel and win, develop courage and achieve a sense of self.
ar: ولذلك تعتبر من احسن الرياضات التنافسية لانها تعمل على تكوين الشخصية وتزيد الفرد ثقة بنفسة و الرغبة فى التفوق والفوز و تنمية الشجاعة و تحقيق الشعور بالذات.

# screen1subtitle10
source: G- Judo achieves many educational goals:
ar: ز- الجودو يحقق الكثير من الاهداف التربوية:-

# screen1dialog18
source: Because judo has ancient traditions and etiquette that go back to two thousand years, this sport was formulated with a number of values ​​and customs, including respect for others, respect for the elderly, not speaking during training, the etiquette of saluting during our path, guiding you, going out and apologizing in case of error, and other etiquette and traditions of the game and its social behaviour. Which affects individuals and thus affects everyone.
ar: فلما للجودو من تقاليد واداب عريقة ترجع الى الفى سنة صيغت تلك الرياضة بعدد من القيم و العادات منها احترام الغير و احترام الكبير وعدم التحدث اثناء التمرين واداب التحية اثناء الدربنا يهديك و الخروج و الاعتذار فى حالة الخطأ وغير ذلك من اداب وتقاليد اللعبة و سلوكياتها الاجتماعية التى تؤثر على الافراد و تنعكس بالتالى على الجميع.

# screen1subtitle11
source: H- Judo is a sport for all:
ar: ح- الجودو رياضة للجميع:-

# screen1dialog19
source: Judo is a sport of different ages, including adults and youth, and people of different shapes and sizes. Therefore, it is considered a sport for all people of all ages. Its effects are in raising the level of physical and health fitness, thus achieving the ideal goal, which is to increase production and raise the livelihood of individuals.
ar: الجودو رياضةالاعمارالمختلفة من البالغين و الشباب و ذوى الاشكال والاحجام المختلفة وبالتالى فهى تعتبر رياضة للجميع من مختلف ابناء الشعب ما يكون اثارها فى رفع مستوى اللياقةالبدنية و الصحية وبذلك تحقق الهدف الامثل وهو زيادة الانتاج ورفع معيشة الافراد.

# screen1dialog20
source: (1860)Master Jigoro Kano, the founder of judo, was born. _ (1880) Jigoro Kano was appointed director of the University of Tokyo. _ (1882) The International Kodokan Institute was founded. _ (1886) The sport of judo spread in Japanese schools and universities. _ ( 1910) A plan was drawn up to train and educate large numbers of trainers. _ (1918) Judo entered England. _ (1938) Professor Jigoro Kano passed away. _ (1939) Judo entered America. _ (1938) The first was held The Japanese Empire Judo Championship. _ (1949) The Japanese Amateur Judo Federation was formed. _ (1952) The International Judo Federation was established. _ (1956) The first World Judo Championship was held. _ (1963) The Egyptian Judo Federation was established. _ ( 1964) Judo entered the Tokyo Olympics for the first time.
ar: _ (1860) ولد الأستاذ جيجورو كانو مؤسس الجودو. _ (1880) عين جيجورو كانو مدير لجامعة طوكيو. _ (1882)تأسس معهد الكودوكان العالمي. _ (1886)انتشرت رياضة الجودو فى المدارس والجامعات اليابانية. _ (1910)وضعت خطة لتدريب وتعليم إعداد كبيرة من المدربين. _ (1918)دخلت رياضة الجودو الى انجلترا. _ (1938)توفى الأستاذ جيجورو كانو. _ (1939)دخلت رياضة الجودو الى أمريكا. _ (1938)أقيمت أول بطولة الإمبراطورية اليابانية للجودو. _ (1949)تكون الاتحاد اليابانى للجودو للهواة. _ (1952)تاسس الاتحاد الدولى للجودو. _ (1956)أقيمت اول بطولة للعالم للجودو. _ (1963)تاسس الاتحاد المصري للجودو. _ (1964)دخلت رياضة الجودو بالاولمبياد بطوكيو اول مرة .

# screen5title
source: Why is warming up important for judo players:-
ar: لما الاحماء (التسخين )مهم للاعبين الجودو:-

# scree5paragraph1
source: The great effort placed on the player's muscles when executing physical effort requires the use of an additional amount of oxygen, and this comes with regulating the breathing process and increasing its speed, as well as the speed of blood circulation. Increasing physical effort and body movements go hand in hand with increasing the metabolic process.' Nutrition for the body, and the body’s systems adapt themselves depending on the external conditions related to the player’s movements and efforts.
ar: الجهد الكبير الذي يقع على عضلات اللاعب عند تنفيذ المجهود البدني يتطلب استخدام كمية إضافية من الأوكسجين , وهذا يأتي بتنظيم عملية التنفس وزيادة سرعته , وكذلك سرعة الدورة الدموية , إن زيادة الجهد البدني وحركات الجسم تسير جنباً إلى جنب مع زيادة عملة التمثيل الغذائي للجسم , وتكيف أجهزة الجسم نفسها تبعاً للظروف الخارجية التي تتصل بحركات اللاعب ومجهوده .

# scree5paragraph2
source: Therefore, it was necessary for the athlete to gradually decline in effort and movement so that the body's internal systems, in turn, could gradually perform their functions to keep pace with the athlete's effort and movement, since the energy of the body's systems to perform their functions is limited.
ar: ولذلك كان من الواجب أن يتدرج اللاعب في ذبل الجهد والحركة حتى تتمكن أجهزة الجسم الداخلية بدورها من التدرج في أداء وظائفها لتساير جهد اللاعب وحركته , ولما كانت طاقة أجهزة الجسم في أداء وظائفها محدودة .

# scree5paragraph3
source: The movements and efforts must not exceed the rate of this energy so as not to cause adverse results and health and physical damage. These devices must be adequately prepared to suit the physical effort expected to be performed. This is done by doing some physical exercises and running exercises of gradual strength before starting In matches, we reach an increase in breathing speed and thus we find a large amount of oxygen in the player’s body, to help the muscles and body systems perform their function, and this prevents common sports injuries.
ar: فانه يجب أن لا تزيد الحركات والمجهود عن معدل هذه الطاقة حتى لاتحد نتائج عكسية وأضرار صحية وبدنية . ويجب إعداد هذه الأجهزة الإعداد الكافي بحيث يناسب المجهود البدني المنتظر أداؤه . ويكون ذلك بالقيام ببعض التمرينات البدنية وتدريبات الجري المتدرجة في القوة قبل بدء المباريات . وبذلك نصل إلى زيادة سرعة التنفس وندخل بالتالي نجد أن كمية كبيرة من الأوكسجين في جسم اللاعب , لمساعدة العضلات وأجهزة الجسم في أداء وظيفتها , وها يمنع إصابات الملاعب الشائعة.
